RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
/**
 *******************************************************************************
 * @file    hc32f4a0_eth.h
 * @brief   This file contains all the Macro Definitions of the ETH driver
 *          library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Yangjp          First version
   2020-07-03       Yangjp          Optimize stc_eth_mac_init_t structure
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_ETH_H__
#define __HC32F4A0_ETH_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_ETH
 * @{
 */

#if (DDL_ETH_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup ETH_Global_Types ETH Global Types
 * @{
 */

/**
 * @brief ETH Common Initialization Structure Definition
 */
typedef struct
{
    uint16_t u16AutoNegotiation;                /*!< Specifies the Auto Negotiation mode for the external PHY.
                                                     This parameter can be a value of @ref ETH_Auto_Negotiation */

    uint16_t u16PHYAddress;                     /*!< Specifies the Ethernet PHY address.
                                                     This parameter must be a number between Min_Data = 0 and Max_Data = 31 */

    uint8_t  au8MACAddr[6];                     /*!< Specifies the MAC Address of used Hardware */

    uint32_t u32MediaInterface;                 /*!< Specifies the media interface.
                                                     This parameter can be a value of @ref ETH_Media_Interface */

    uint32_t u32Speed;                          /*!< Specifies the Ethernet speed.
                                                     This parameter can be a value of @ref ETH_Speed */

    uint32_t u32DuplexMode;                     /*!< Specifies the MAC duplex mode.
                                                     This parameter can be a value of @ref ETH_Duplex_Mode */

    uint32_t u32ChecksumMode;                   /*!< Specifies the checksum check by hardware or by software.
                                                     This parameter can be a value of @ref ETH_Checksum_Mode */

    uint32_t u32RxMode;                         /*!< Specifies the Ethernet Rx mode.
                                                     This parameter can be a value of @ref ETH_Rx_Mode */
} stc_eth_comm_init_t;

/**
 * @brief ETH MAC Initialization Structure Definition
 */
typedef struct
{
    uint32_t u32TxClkPolarity;                  /*!< Specifies the Tx clock polarity.
                                                     This parameter can be a value of @ref ETH_TX_CLK_POLARITY */

    uint32_t u32RxRefClkPolarity;               /*!< Specifies the Rx/Ref clock polarity.
                                                     This parameter can be a value of @ref ETH_RX_REF_CLK_POLARITY */

    uint32_t u32SAInsertMode;                   /*!< Specifies the Source Address Insert or Replace Mode.
                                                     This parameter can be a value of @ref ETH_SA_Insert_Mode */

    uint32_t u32TypeFrameStripFCS;              /*!< Specifies the validity of stripping FCS for type frame.
                                                     This parameter can be a value of @ref ETH_TypeFrame_Strip_FCS */

    uint32_t u32Watchdog;                       /*!< Specifies the validity of the Watchdog timer.
                                                     This parameter can be a value of @ref ETH_Watchdog */

    uint32_t u32Jabber;                         /*!< Specifies the validity of the Jabber timer.
                                                     This parameter can be a value of @ref ETH_Jabber */

    uint32_t u32InterFrameGap;                  /*!< Specifies the minimum gap between frames during transmission.
                                                     This parameter can be a value of @ref ETH_Inter_Frame_Gap */

    uint32_t u32CarrierSense;                   /*!< Specifies the validity of the Carrier Sense (Half-Duplex mode).
                                                     This parameter can be a value of @ref ETH_Carrier_Sense */

    uint32_t u32ReceiveOwn;                     /*!< Specifies the validity of the Receive Own (Half-Duplex mode).
                                                     This parameter can be a value of @ref ETH_Receive_Own */

    uint32_t u32ChecksumOffload;                /*!< Specifies the validity of the IPv4 checksum Offload.
                                                     This parameter can be a value of @ref ETH_Checksum_Offload */

    uint32_t u32RetryTransmit;                  /*!< Specifies the validity of the MAC attempt to retry Transmit (Half-Duplex mode).
                                                     This parameter can be a value of @ref ETH_Retry_Transmit */

    uint32_t u32AutoStripPadFCS;                /*!< Specifies the validity of the Automatic Stripping Pad/FCS of MAC.
                                                     This parameter can be a value of @ref ETH_Auto_Strip_Pad_FCS */

    uint32_t u32BackOffLimit;                   /*!< Specifies the BackOff limit value (Half-Duplex mode).
                                                     This parameter can be a value of @ref ETH_Back_Off_Limit */

    uint32_t u32DeferralCheck;                  /*!< Specifies the validity of the deferral check (Half-Duplex mode).
                                                     This parameter can be a value of @ref ETH_Deferral_Check */

    uint16_t u16PauseTime;                      /*!< Specifies the Pause Time in the transmit control frame.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFF */

    uint32_t u32ZeroQuantaPause;                /*!< Specifies the validity of the automatic generation Zero-Quanta Pause Control frame.
                                                     This parameter can be a value of @ref ETH_Zero_Quanta_Pause */

    uint32_t u32PauseLowThreshold;              /*!< Specifies the PAUSE Frame threshold.
                                                     This parameter can be a value of @ref ETH_Pause_Low_Threshold */

    uint32_t u32UnicastPauseFrameDetect;        /*!< Specifies the validity of the detection unicast Pause frame.
                                                     This parameter can be a value of @ref ETH_Unicast_Pause_Frame_Detect */

