RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
    uint32_t u32ReceiveFlowControl;             /*!< Specifies the validity of the decoding function that receive Pause frame.
                                                     This parameter can be a value of @ref ETH_Receive_Flow_Control */

    uint32_t u32TransmitFlowControl;            /*!< Specifies the validity of the MAC transmit Pause frame (Full-Duplex mode) or the MAC back-pressure operation (Half-Duplex mode).
                                                     This parameter can be a value of @ref ETH_Transmit_Flow_Control */

    uint32_t u32ReceiveAll;                     /*!< Specifies the validity of the all frames reception by the MAC (No filtering).
                                                     This parameter can be a value of @ref ETH_Receive_All */

    uint32_t u32DropNotTcpUdp;                  /*!< Specifies the validity of Dropping all IP datagram without TCP/UDP field.
                                                     This parameter can be a value of @ref ETH_Drop_Not_TcpUdp */

    uint32_t u32VlanTagFilter;                  /*!< Specifies the validity of the VLAN Tag Filter.
                                                     This parameter can be a value of @ref ETH_VLAN_Tag_Filter */

    uint32_t u32SAFilter;                       /*!< Specifies the Source Address Filter mode.
                                                     This parameter can be a value of @ref ETH_Source_Addr_Filter */

    uint32_t u32PassControlFrame;               /*!< Specifies the forwarding mode of the control frame.
                                                     This parameter can be a value of @ref ETH_Pass_Control_Frame */

    uint32_t u32BroadcastFrameReception;        /*!< Specifies the validity of the reception Broadcast Frame.
                                                     This parameter can be a value of @ref ETH_Broadcast_Frame_Reception */

    uint32_t u32DAFilter;                       /*!< Specifies the destination filter mode for both unicast and multicast frame.
                                                     This parameter can be a value of @ref ETH_Destination_Addr_Filter */

    uint32_t u32MulticastFrameFilter;           /*!< Specifies the Multicast Frame filter mode.
                                                     This parameter can be a value of @ref ETH_Multicast_Frame_Filter */

    uint32_t u32UnicastFrameFilter;             /*!< Specifies the Unicast Frame filter mode.
                                                     This parameter can be a value of @ref ETH_Unicast_Frame_Filter */

    uint32_t u32PromiscuousMode;                /*!< Specifies the validity of the Promiscuous Mode.
                                                     This parameter can be a value of @ref ETH_Promiscuous_Mode */

    uint32_t u32HashTableHigh;                  /*!< Specifies the higher 32 bits of Hash table.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

    uint32_t u32HashTableLow;                   /*!< Specifies the lower 32 bits of Hash table.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

    uint32_t u32TxVlanInsertMode;               /*!< Specifies the VLAN insert mode in Transmit frame.
                                                     This parameter can be a value of @ref ETH_Tx_VLAN_Insert_Mode */

    uint16_t u16TxVlanTag;                      /*!< Specifies the VLAN tag value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFF */

    uint32_t u32RxVlanFilter;                   /*!< Specifies the VLAN filter mode in Receive frame.
                                                     This parameter can be a value of @ref ETH_Rx_VLAN_Filter */

    uint32_t u32RxVlanComparison;               /*!< Specifies the bits for comparison VLAN tag.
                                                     This parameter can be a value of @ref ETH_Rx_VLAN_Comparison */

    uint16_t u16RxVlanTag;                      /*!< Specifies the VLAN tag value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFF */

    uint16_t u16RxVlanHashTable;                /*!< Specifies the lower 16 bits of VLAN Hash table.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFF */
} stc_eth_mac_init_t;

/**
 * @brief ETH DMA Initialization Structure Definition
 */
typedef struct
{
    uint32_t u32BurstMode;                      /*!< Specifies the AHB Master interface burst transmission Mode.
                                                     This parameter can be a value of @ref ETH_Burst_Mode */

    uint32_t u32AddressAlign;                   /*!< Specifies the validity of the Address Align.
                                                     This parameter can be a value of @ref ETH_Address_Align */

    uint32_t u32RxDMABurstLength;               /*!< Specifies the maximum number of beats to be transferred in one Rx DMA transaction.
                                                     This parameter can be a value of @ref ETH_Rx_DMA_Burst_Length */

    uint32_t u32TxDMABurstLength;               /*!< Specifies the maximum number of beats to be transferred in one Tx DMA transaction.
                                                     This parameter can be a value of @ref ETH_Tx_DMA_Burst_Length */

    uint32_t u32EnhanceDescriptor;              /*!< Specifies the validity of the enhance descriptor format.
                                                     This parameter can be a value of @ref ETH_DMA_Enhance_Descriptor */

    uint32_t u32DescriptorSkipLength;           /*!< Specifies the number of word to skip between two unchain descriptors (Ring mode)
                                                     This parameter must be a number between Min_Data = 0 and Max_Data = 31 */

