RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
    uint32_t u32DMAArbitration;                 /*!< Specifies the DMA Tx/Rx arbitration.
                                                     This parameter can be a value of @ref ETH_DMA_Arbitration */

    uint32_t u32DropChecksumErrorFrame;         /*!< Specifies the validity of Dropping TCP/IP Checksum Error Frame.
                                                     This parameter can be a value of @ref ETH_Drop_TCPIP_Checksum_Error_Frame */

    uint32_t u32ReceiveStoreForward;            /*!< Specifies the validity of the Receive store and forward mode.
                                                     This parameter can be a value of @ref ETH_Receive_Store_Forward */

    uint32_t u32FlushReceiveFrame;              /*!< Specifies the validity of the flushing receive frame.
                                                     This parameter can be a value of @ref ETH_Flush_Receive_Frame */

    uint32_t u32TransmitStoreForward;           /*!< Specifies the validity of the Transmit store and forward mode.
                                                     This parameter can be a value of @ref ETH_Transmit_Store_Forward */

    uint32_t u32TransmitThreshold;              /*!< Specifies the Transmit Threshold.
                                                     This parameter can be a value of @ref ETH_Transmit_Threshold */

    uint32_t u32ForwardErrorFrame;              /*!< Specifies the validity of the forward erroneous frame.
                                                     This parameter can be a value of @ref ETH_Forward_Error_Frame */

    uint32_t u32ForwardUndersizeGoodFrame;     /*!< Specifies the validity of the Rx FIFO to forward Undersize frame.
                                                     This parameter can be a value of @ref ETH_Forward_Undersize_Good_Frame */

    uint32_t u32DropJumboFrame;                 /*!< Specifies the validity of Dropping jumbo Frame.
                                                     This parameter can be a value of @ref ETH_Drop_Jumbo_Frame */

    uint32_t u32ReceiveThreshold;               /*!< Specifies the threshold level of the Receive FIFO.
                                                     This parameter can be a value of @ref ETH_Receive_Threshold */

    uint32_t u32SecondFrameOperate;             /*!< Specifies the validity of the Operate on second frame mode.
                                                     This parameter can be a value of @ref ETH_Second_Frame_Operate */
} stc_eth_dma_init_t;

/**
 * @brief ETH MMC Initialization Structure Definition
 */
typedef struct
{
    uint32_t u32PresetMode;                     /*!< Specifies the MMC Counter preset mode.
                                                     This parameter can be a value of @ref ETH_MMC_Counter_Preset_Mode */

    uint32_t u32ReadReset;                      /*!< Specifies the validity of the MMC Reset on read.
                                                     This parameter can be a value of @ref ETH_MMC_Read_Reset */

    uint32_t u32ReloadMode;                     /*!< Specifies the validity of the MMC Counter reload.
                                                     This parameter can be a value of @ref ETH_MMC_Counter_Reload */
} stc_eth_mmc_init_t;

/**
 * @brief ETH PTP Initialization Structure Definition
 */
typedef struct
{
    uint32_t u32DAFilter;                       /*!< Specifies the validity of the DA filter for the PTP frame.
                                                     This parameter can be a value of @ref ETH_PTP_Frame_DA_Filter */

    uint32_t u32SnapDatagramType;               /*!< Specifies the PTP snapshot datagram type.
                                                     This parameter can be a value of @ref ETH_PTP_Snapshot_Datagram_Type */

    uint32_t u32SnapFrameType;                  /*!< Specifies the PTP snapshot frame type.
                                                     This parameter can be any combination of @ref ETH_PTP_Snapshot_Frame_Type */

    uint32_t u32DatagramVersion;                /*!< Specifies the PTP datagram version.
                                                     This parameter can be a value of @ref ETH_PTP_Datagram_Version */

    uint32_t u32SubSecScale;                    /*!< Specifies the PTP Time Stamp subsecond scale.
                                                     This parameter can be a value of @ref ETH_PTP_Subsecond_Scale */

    uint32_t u32CalibMode;                      /*!< Specifies the PTP Time Stamp calibration mode.
                                                     This parameter can be a value of @ref ETH_PTP_Calibration_Mode */

    uint32_t u32IncValueBasic;                  /*!< Specifies the PTP Time Stamp Basic increase value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

    uint8_t  u8IncValueSubSec;                  /*!< Specifies the PTP Time Stamp Subsecond increase value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFF */

    uint32_t u32InitValueSec;                   /*!< Specifies the PTP Time Stamp Second Initial value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

    uint32_t u32InitValueSubSec;                /*!< Specifies the PTP Time Stamp Subsecond Initial value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0x7FFFFFFF */
} stc_eth_ptp_init_t;

/**
 * @brief ETH PPS Configuration Structure Definition
 */
typedef struct
{
    uint32_t u32TargetTimeFunc;                 /*!< Specifies the arrival time trigger the function.
                                                     This parameter can be a value of @ref ETH_PPS_Target_Time_Function */

    uint32_t u32OutputMode;                     /*!< Specifies the PPS output mode.
                                                     This parameter can be a value of @ref ETH_PPS_Output_Mode */

    uint32_t u32OutputFreq;                     /*!< Specifies the PPS outout frequency.
                                                     This parameter can be any combination of @ref ETH_PPS_Output_Frequency */

