RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
    uint32_t u32TargetTimeSec;                  /*!< Specifies the PPS Target Time for Second.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

    uint32_t u32TargetTimeSubSec;               /*!< Specifies the PPS Target Time for Subsecond.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0x7FFFFFFF */
} stc_eth_pps_config_t;

/**
 * @brief ETH DMA Descriptor Structure Definition
 */
typedef struct
{
    __IO uint32_t u32ControlStatus;             /*!< Control and Status */
    uint32_t      u32ControlBufferSize;         /*!< Control and Buffer1, Buffer2 lengths */
    uint32_t      u32Buffer1Addr;               /*!< Buffer1 address pointer */
    uint32_t      u32Buffer2NextDescAddr;       /*!< Buffer2 or next descriptor address pointer */
    /*!< Enhance Ethernet DMA Descriptors */
    __IO uint32_t u32ExtendStatus;              /*!< Extend status */
    uint32_t      Reserved;                     /*!< Reserved */
    uint32_t      u32TimeStampLow;              /*!< Time Stamp Low value for transmit and receive */
    uint32_t      u32TimeStampHigh;             /*!< Time Stamp High value for transmit and receive */
} stc_eth_dma_desc_t;

/**
 * @brief ETH DMA Received Frame Structure Definition
 */
typedef struct
{
    stc_eth_dma_desc_t *pstcFSDesc;             /*!< First Segment Rx Desc */
    stc_eth_dma_desc_t *pstcLSDesc;             /*!< Last Segment Rx Desc  */
    uint32_t           u32SegCount;             /*!< Segment count         */
    uint32_t           u32Length;               /*!< Frame length          */
    uint32_t           u32Buffer;               /*!< Frame buffer          */
} stc_eth_dma_rx_frame_t;

/**
 * @brief ETH Initialization Structure Definition
 */
typedef struct
{
    stc_eth_mac_init_t stcMacInit;              /*!< Ethernet MAC Initialization */
    stc_eth_dma_init_t stcDmaInit;              /*!< Ethernet DMA Initialization */
} stc_eth_init_t;

/**
 * @brief ETH Handle Structure Definition
 */
typedef struct
{
    stc_eth_comm_init_t     stcCommInit;        /*!< ETH Common Initialization */
    stc_eth_dma_desc_t      *stcRxDesc;         /*!< Rx descriptor to Get */
    stc_eth_dma_desc_t      *stcTxDesc;         /*!< Tx descriptor to Set */
    stc_eth_dma_rx_frame_t  stcRxFrame;         /*!< last Rx frame */
} stc_eth_handle_t;

/**
 * @brief ETH MAC Address Configuration Structure Definition
 */
typedef struct
{
    uint32_t u32MacAddrFilter;                  /*!< Specifies the MAC Address filter mode.
                                                     This parameter can be a value of @ref ETH_MAC_Address_Filter */

    uint32_t u32MacAddrMask;                    /*!< Specifies the MAC Address filter Mask.
                                                     This parameter can be a value of @ref ETH_MAC_Address_Filter_Mask */

    uint8_t  au8MACAddr[6];                     /*!< Specifies the MAC Address of used Hardware */
} stc_eth_mac_addr_config_t;

/**
 * @brief ETH L3L4 Filter Configuration Structure Definition
 */
typedef struct
{
    uint32_t u32L4DestPortFilter;               /*!< Specifies the L4 Destination port filter mode.
                                                     This parameter can be a value of @ref ETH_L4_Dest_Port_Filter */

    uint32_t u32L4SourcePortFilter;             /*!< Specifies the L4 Source port filter mode.
                                                     This parameter can be a value of @ref ETH_L4_Source_Port_Filter */

    uint32_t u32L4PortFilterProtocol;           /*!< Specifies the L4 protocol for port filter operation.
                                                     This parameter can be a value of @ref ETH_L4_Port_Filter_Protocol */

    uint32_t u32L3Ipv4DAFilterMask;             /*!< Specifies the L3 Destination Address filter mask in IPv4.
                                                     This parameter can be a value of @ref ETH_L3_Dest_Addr_Filter_Mask */

    uint32_t u32L3Ipv4SAFilterMask;             /*!< Specifies the L3 Source Address filter Mask in IPv4.
                                                     This parameter can be a value of @ref ETH_L3_Source_Addr_Filter_Mask */

    uint32_t u32L3Ipv6AddrFilterMask;           /*!< Specifies the L3 Destination/Source Address filter Mask in IPv6.
                                                     This parameter can be a value of @ref ETH_L3_DA_SA_Filter_Mask */

    uint32_t u32L3DAFilter;                     /*!< Specifies the L3 Destination Address filter mode.
                                                     This parameter can be a value of @ref ETH_L3_Dest_Addr_Filter */

    uint32_t u32L3SAFilter;                     /*!< Specifies the L3 Source Address filter mode.
                                                     This parameter can be a value of @ref ETH_L3_Source_Addr_Filter */

    uint32_t u32L3AddrFilterProtocol;           /*!< Specifies the L3 protocol for address filter operation.
                                                     This parameter can be a value of @ref ETH_L3_Addr_Filter_Protocol */

    uint16_t u16L4DestProtFilterValue;          /*!< Specifies the L4 Destination port filter value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFF */

    uint16_t u16L4SourceProtFilterValue;        /*!< Specifies the L4 Source port filter value.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFF */

    uint32_t u32L3Ipv4DAFilterValue;            /*!< Specifies the L3 Destination Address filter value in IPv4.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

    uint32_t u32L3Ipv4SAFilterValue;            /*!< Specifies the L3 Source Address filter value in IPv4.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

