RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
    uint32_t au32L3Ipv6AddrFilterValue[4];      /*!< Specifies the L3 Destination/Source Address filter value in IPv6.
                                                     This parameter must be a number between Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */
} stc_eth_l3l4_filter_config_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ETH_Global_Macros ETH Global Macros
 * @{
 */

/**
 * @defgroup ETH_Buffer_Define ETH Buffer Define
 * @{
 */
#define ETH_PACKET_MAX_SIZE           (1524U)   /*!< ETH_HEADER + ETH_EXTRA + ETH_VLAN_TAG + ETH_MAX_PAYLOAD + ETH_CRC */
#define ETH_HEADER                    (14U)     /*!< 6 byte Dest addr, 6 byte Src addr, 2 byte length/type */
#define ETH_CRC                       (4U)      /*!< Ethernet CRC */
#define ETH_EXTRA                     (2U)      /*!< Extra bytes in some cases */
#define ETH_VLAN_TAG                  (4U)      /*!< Optional 802.1Q VLAN Tag */
#define ETH_MIN_PAYLOAD               (46U)     /*!< Ethernet minimum payload size */
#define ETH_MAX_PAYLOAD               (1500U)   /*!< Ethernet maximum payload size */
#define ETH_JUMBO_FRAME_PAYLOAD       (9000U)   /*!< Jumbo frame payload size */

/* In below are defined the size of one Ethernet driver transmit buffer ETH_TXBUF_SIZE
   and the total count of the driver transmit buffers ETH_TXBUF_NUMBER.

   The configured value for ETH_TXBUF_SIZE and ETH_TXBUF_NUMBER are only provided as
   example, they can be reconfigured in the application layer to fit the application
   needs */

/* Configure the transmit buffer size for each Ethernet driver */
#ifndef ETH_TXBUF_SIZE
  #define ETH_TXBUF_SIZE              ETH_PACKET_MAX_SIZE
#endif

/* Configure the number of Ethernet driver transmit buffers (in a chained linked list)*/
#ifndef ETH_TXBUF_NUMBER
 #define ETH_TXBUF_NUMBER             (5U)      /* 5 Tx buffers of size ETH_TXBUF_SIZE */
#endif

/* In below are defined the size of one Ethernet driver receive buffer ETH_RXBUF_SIZE
   and the total count of the driver receive buffers ETH_RXBUF_NUMBER.

   The configured value for ETH_RXBUF_SIZE and ETH_RXBUF_NUMBER are only provided as
   example, they can be reconfigured in the application layer to fit the application
   needs */

/* Configure the receive buffer size for each Ethernet driver */
#ifndef ETH_RXBUF_SIZE
  #define ETH_RXBUF_SIZE              ETH_PACKET_MAX_SIZE
#endif

/* Configure the number of Ethernet drive receive buffers (in a chained linked list)*/
#ifndef ETH_RXBUF_NUMBER
  #define ETH_RXBUF_NUMBER            (5U)      /* 5 Rx buffers of size ETH_RXBUF_SIZE */
#endif

/**
 * @}
 */

/**
 * @defgroup ETH_DMA_TX_Descriptor ETH DMA TX Descriptor
 * @{
 */

/*
  Normal DMA Tx Descriptor
  -----------------------------------------------------------------------------------------------
  TDES0 | OWN(31)  |  CTRL[30:26]  |  TTSE(25)  |  CTRL[24:18]  |  TTSS(17)  |  Status[16:0]     |
  -----------------------------------------------------------------------------------------------
  TDES1 | CTRL[31:29] | Buffer2 ByteCount[28:16] | Reserved[15:13] | Buffer1 ByteCount[12:0]     |
  -----------------------------------------------------------------------------------------------
  TDES2 |                         Buffer1 Address [31:0]                                         |
  -----------------------------------------------------------------------------------------------
  TDES3 |                   Buffer2 Address [31:0] / Next Descriptor Address [31:0]              |
  -----------------------------------------------------------------------------------------------
 */

/**
 * @brief Bit definition of TDES0 register
 */
#define ETH_DMATXDESC_OWN                           (0x80000000UL)  /*!< OWN bit */
#define ETH_DMATXDESC_IOC                           (0x40000000UL)  /*!< Interrupt on Completion */
#define ETH_DMATXDESC_TLS                           (0x20000000UL)  /*!< Transmit Last Segment */
#define ETH_DMATXDESC_TFS                           (0x10000000UL)  /*!< Transmit First Segment */
#define ETH_DMATXDESC_DCRC                          (0x08000000UL)  /*!< Disable CRC */
#define ETH_DMATXDESC_DPAD                          (0x04000000UL)  /*!< Disable Padding */
#define ETH_DMATXDESC_TTSE                          (0x02000000UL)  /*!< Transmit Time Stamp Enable */
#define ETH_DMATXDESC_CRCR                          (0x01000000UL)  /*!< CRC Replace Control */
#define ETH_DMATXDESC_CIC                           (0x00C00000UL)  /*!< Checksum Insertion Control: 4 cases */
#define ETH_DMATXDESC_CIC_BYPASS                    (0x00000000UL)  /*!< Do Nothing: Checksum Engine is bypassed */
#define ETH_DMATXDESC_CIC_IPV4HEADER                (0x00400000UL)  /*!< IPV4 header Checksum Insertion */
#define ETH_DMATXDESC_CIC_TCPUDPICMP_SEGMENT        (0x00800000UL)  /*!< TCP/UDP/ICMP Checksum Insertion calculated over segment only */
#define ETH_DMATXDESC_CIC_TCPUDPICMP_FULL           (0x00C00000UL)  /*!< TCP/UDP/ICMP Checksum Insertion fully calculated */
#define ETH_DMATXDESC_TER                           (0x00200000UL)  /*!< Transmit End of Ring */
#define ETH_DMATXDESC_TSAC                          (0x00100000UL)  /*!< Second Address Chained */
#define ETH_DMATXDESC_VLANC                         (0x000C0000UL)  /*!< VLAN Insertion Control: 4 cases */
#define ETH_DMATXDESC_VLANC_BYPASS                  (0x00000000UL)  /*!< Do Nothing: VLAN Insertion is bypassed */
#define ETH_DMATXDESC_VLANC_REMOVE_TAG              (0x00040000UL)  /*!< Remove Tag and Type fields in VLAN frame */
#define ETH_DMATXDESC_VLANC_INSERT_TAG              (0x00080000UL)  /*!< Insert VLAN Tag value in ETH_MAC_VTACTLR Register into transmit frame */
#define ETH_DMATXDESC_VLANC_REPLACE_TAG             (0x000C0000UL)  /*!< Replace VLAN tag value in transmit frame with VLAN tag value in ETH_MAC_VTACTLR register */
#define ETH_DMATXDESC_TTSS                          (0x00020000UL)  /*!< Tx Time Stamp Status */
#define ETH_DMATXDESC_IHE                           (0x00010000UL)  /*!< IP Header Error */
#define ETH_DMATXDESC_ETSUM                         (0x00008000UL)  /*!< Tx Error summary: OR of the following bits: IHE || JTE || FFF || TPCE || LOCE || NCE || TLCE || ECE || EDE || UDE */
#define ETH_DMATXDESC_JTE                           (0x00004000UL)  /*!< Jabber Timeout Error */
#define ETH_DMATXDESC_FFF                           (0x00002000UL)  /*!< Frame Flushed */
#define ETH_DMATXDESC_TPCE                          (0x00001000UL)  /*!< Payload Checksum Error */
#define ETH_DMATXDESC_LOCE                          (0x00000800UL)  /*!< Loss Carrier Error */
#define ETH_DMATXDESC_NCE                           (0x00000400UL)  /*!< No Carrier Error */
#define ETH_DMATXDESC_TLCE                          (0x00000200UL)  /*!< Late Collision Error */
#define ETH_DMATXDESC_ECE                           (0x00000100UL)  /*!< Excessive Collision Error */
#define ETH_DMATXDESC_VLF                           (0x00000080UL)  /*!< VLAN Frame */
#define ETH_DMATXDESC_COC                           (0x00000078UL)  /*!< Collision Count */
#define ETH_DMATXDESC_EDE                           (0x00000004UL)  /*!< Excessive Deferral Error */
#define ETH_DMATXDESC_UDE                           (0x00000002UL)  /*!< Underflow Error */
#define ETH_DMATXDESC_DEE                           (0x00000001UL)  /*!< Deferred Error */

/**
 * @brief Bit definition of TDES1 register
 */
#define ETH_DMATXDESC_SAIRC                         (0xE0000000UL)  /*!< Source Address Insertion or Replace Control: 5 cases */
#define ETH_DMATXDESC_SAIRC_BYPASS                  (0x00000000UL)  /*!< Do Nothing: Source Address Insertion or Replace Control is bypassed */
#define ETH_DMATXDESC_SAIRC_INSTER_MACADDR0         (0x20000000UL)  /*!< Insert address value in MAC address register 0 into transmit frame as SA address */
#define ETH_DMATXDESC_SAIRC_REPLACE_MACADDR0        (0x40000000UL)  /*!< Replace SA address in transmit frame with address value in MAC address register 0 */
#define ETH_DMATXDESC_SAIRC_INSTER_MACADDR1         (0xA0000000UL)  /*!< Insert address value in MAC address register 1 into transmit frame as SA address */
#define ETH_DMATXDESC_SAIRC_REPLACE_MACADDR1        (0xC0000000UL)  /*!< Replace SA address in transmit frame with address value in MAC address register 1 */
#define ETH_DMATXDESC_TBS2                          (0x1FFF0000UL)  /*!< Transmit Buffer2 Size */
#define ETH_DMATXDESC_TBS1                          (0x00001FFFUL)  /*!< Transmit Buffer1 Size */

/**
 * @brief Bit definition of TDES2 register
 */
#define ETH_DMATXDESC_TBAP1                         (0xFFFFFFFFUL)  /*!< Buffer1 Address Pointer */

/**
 * @brief Bit definition of TDES3 register
 */
#define ETH_DMATXDESC_TBAP2                         (0xFFFFFFFFUL)  /*!< Buffer2 Address Pointer */

