RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
/*
  Enhance DMA Tx Descriptor
  -----------------------------------------------------------------------------------------------
  TDES4 |                                Reserved[31:0]                                          |
  -----------------------------------------------------------------------------------------------
  TDES5 |                                Reserved[31:0]                                          |
  -----------------------------------------------------------------------------------------------
  TDES6 |                         Transmit Time Stamp Low [31:0]                                 |
  -----------------------------------------------------------------------------------------------
  TDES7 |                         Transmit Time Stamp High [31:0]                                |
  -----------------------------------------------------------------------------------------------
 */

/**
 * @brief Bit definition of TDES6 register
 */
 #define ETH_DMATXDESC_TTSL                         (0xFFFFFFFFUL)  /*!< Transmit Time Stamp Low */

/**
 * @brief Bit definition of TDES7 register
 */
 #define ETH_DMATXDESC_TTSH                         (0xFFFFFFFFUL)  /*!< Transmit Time Stamp High */

/**
 * @}
 */

/**
 * @defgroup ETH_DMA_RX_Descriptor ETH DMA RX Descriptor
 * @{
 */

/*
  Normal DMA Rx Descriptor
  --------------------------------------------------------------------------------------------------------------------
  RDES0 | OWN(31) |                                             Status [30:0]                                          |
  ---------------------------------------------------------------------------------------------------------------------
  RDES1 | CTRL(31) | Reserved[30:29] | Buffer2 ByteCount[28:16] | CTRL[15:14] | Reserved(13) | Buffer1 ByteCount[12:0] |
  ---------------------------------------------------------------------------------------------------------------------
  RDES2 |                                       Buffer1 Address [31:0]                                                 |
  ---------------------------------------------------------------------------------------------------------------------
  RDES3 |                          Buffer2 Address [31:0] / Next Descriptor Address [31:0]                             |
  ---------------------------------------------------------------------------------------------------------------------
*/

/**
 * @brief Bit definition of RDES0 register
 */
#define ETH_DMARXDESC_OWN                           (0x80000000UL)  /*!< OWN bit */
#define ETH_DMARXDESC_DAF                           (0x40000000UL)  /*!< DA Filter Fail for the received frame */
#define ETH_DMARXDESC_FRAL                          (0x3FFF0000UL)  /*!< Receive frame length */
#define ETH_DMARXDESC_ERSUM                         (0x00008000UL)  /*!< Rx Error summary: OR of the following bits: DPE || OVE || IPE_TSPA_GF || RLCE || WTE || REE || CRE in RDES0, or IPPE || IPHE in RDES4 */
#define ETH_DMARXDESC_DPE                           (0x00004000UL)  /*!< Descriptor Error: no more descriptors for receive frame */
#define ETH_DMARXDESC_SAF                           (0x00002000UL)  /*!< SA Filter Fail for the received frame */
#define ETH_DMARXDESC_LEE                           (0x00001000UL)  /*!< Length Error: Frame size not matching with length field */
#define ETH_DMARXDESC_OVE                           (0x00000800UL)  /*!< Overflow Error: Frame was damaged due to buffer overflow */
#define ETH_DMARXDESC_VLAT                          (0x00000400UL)  /*!< VLAN Tag: received frame is a VLAN frame */
#define ETH_DMARXDESC_RFS                           (0x00000200UL)  /*!< First descriptor */
#define ETH_DMARXDESC_RLS                           (0x00000100UL)  /*!< Last descriptor */
#define ETH_DMARXDESC_IPE_TSPA_GF                   (0x00000080UL)  /*!< COE Error or Time stamp valid or jumbo frame */
#define ETH_DMARXDESC_RLCE                          (0x00000040UL)  /*!< Late collision Error */
#define ETH_DMARXDESC_FRAT                          (0x00000020UL)  /*!< Frame type: Ethernet or PTP */
#define ETH_DMARXDESC_WTE                           (0x00000010UL)  /*!< Receive Watchdog Timeout */
#define ETH_DMARXDESC_REE                           (0x00000008UL)  /*!< Receive error: error reported by PHY RX_ER */
#define ETH_DMARXDESC_DBE                           (0x00000004UL)  /*!< Dribble bit error: frame contains non int multiple of 8 bits  */
#define ETH_DMARXDESC_CRE                           (0x00000002UL)  /*!< CRC error */
#define ETH_DMARXDESC_DAS_ESA                       (0x00000001UL)  /*!< MAC Address Filter/Status bit extension */

/**
 * @brief Bit definition of RDES1 register
 */
#define ETH_DMARXDESC_DIC                           (0x80000000UL)  /*!< Disable Interrupt on Completion */
#define ETH_DMARXDESC_RBS2                          (0x1FFF0000UL)  /*!< Receive Buffer2 Size */
#define ETH_DMARXDESC_RER                           (0x00008000UL)  /*!< Receive End of Ring */
#define ETH_DMARXDESC_RSAC                          (0x00004000UL)  /*!< Second Address Chained */
#define ETH_DMARXDESC_RBS1                          (0x00001FFFUL)  /*!< Receive Buffer1 Size */

/**
 * @brief Bit definition of RDES2 register
 */
#define ETH_DMARXDESC_RBAP1                         (0xFFFFFFFFUL)  /*!< Buffer1 Address Pointer */

/**
 * @brief Bit definition of RDES3 register
 */
#define ETH_DMARXDESC_RBAP2                         (0xFFFFFFFFUL)  /*!< Buffer2 Address Pointer */

/*
  Enhance DMA Rx Descriptor
  -----------------------------------------------------------------------------------------------
  RDES4 |    Reserved[31:26] | Extend Status [25:24] | Reserved[23:15] | Extend Status [14:0]    |
  -----------------------------------------------------------------------------------------------
  RDES5 |                                    Reserved[31:0]                                      |
  -----------------------------------------------------------------------------------------------
  RDES6 |                               Receive Time Stamp Low [31:0]                            |
  -----------------------------------------------------------------------------------------------
  RDES7 |                               Receive Time Stamp High [31:0]                           |
  -----------------------------------------------------------------------------------------------
*/

/**
 * @brief Bit definition of RDES4 register
 */
#define ETH_DMARXDESC_L4FMS                         (0x02000000UL)  /*!< L4 Port Filter Status */
#define ETH_DMARXDESC_L3FMS                         (0x01000000UL)  /*!< L3 Address Filter Status */
#define ETH_DMARXDESC_TSPD                          (0x00004000UL)  /*!< Discard Time Stamp */
#define ETH_DMARXDESC_PTPV                          (0x00002000UL)  /*!< PTP Version */
#define ETH_DMARXDESC_PTPFT                         (0x00001000UL)  /*!< PTP Frame Type */
#define ETH_DMARXDESC_MTP                           (0x00000F00UL)  /*!< PTP Datagram Type */
#define ETH_DMARXDESC_MTP_NONE                      (0x00000000UL)  /*!< No PTP messages */
#define ETH_DMARXDESC_MTP_SYNC                      (0x00000100UL)  /*!< SYNC message (all clock types) */
#define ETH_DMARXDESC_MTP_FOLLOWUP                  (0x00000200UL)  /*!< Follow_Up message (all clock types) */
#define ETH_DMARXDESC_MTP_DELAYREQ                  (0x00000300UL)  /*!< Delay_Req message (all clock types) */
#define ETH_DMARXDESC_MTP_DELAYRESP                 (0x00000400UL)  /*!< Delay_Resp message (all clock types) */
#define ETH_DMARXDESC_MTP_PDELAYREQ                 (0x00000500UL)  /*!< Pdelay_Req message (peer-to-peer transparent clock) */
#define ETH_DMARXDESC_MTP_PDELAYRESP                (0x00000600UL)  /*!< Pdelay_Resp message (peer-to-peer transparent clock) */
#define ETH_DMARXDESC_MTP_PDELAYRESP_FOLLOWUP       (0x00000700UL)  /*!< Pdelay_Resp_Follow_Up message (peer-to-peer transparent clock) */
#define ETH_DMARXDESC_MTP_ANNOUNCE                  (0x00000800UL)  /*!< Announce message (Ordinary or Boundary clock) */
#define ETH_DMARXDESC_MTP_MANAGEMENT                (0x00000900UL)  /*!< Management message (Ordinary or Boundary clock) */
#define ETH_DMARXDESC_MTP_SIGNALING                 (0x00000A00UL)  /*!< Signaling message (Ordinary or Boundary clock) */
#define ETH_DMARXDESC_MTP_DEFAULT                   (0x00000F00UL)  /*!< Default Datagram Type */
#define ETH_DMARXDESC_IPV6DR                        (0x00000080UL)  /*!< IPv6 Packet Received */
#define ETH_DMARXDESC_IPV4DR                        (0x00000040UL)  /*!< IPv4 Packet Received */
#define ETH_DMARXDESC_IPCB                          (0x00000020UL)  /*!< COE engine Bypassed */
#define ETH_DMARXDESC_IPPE                          (0x00000010UL)  /*!< IP Payload Error */
#define ETH_DMARXDESC_IPHE                          (0x00000008UL)  /*!< IP Header Error */
#define ETH_DMARXDESC_IPPT                          (0x00000007UL)  /*!< IP Payload Type: 4 cases */
#define ETH_DMARXDESC_IPPT_UNKNOWN                  (0x00000000UL)  /*!< Unknown */
#define ETH_DMARXDESC_IPPT_UDP                      (0x00000001UL)  /*!< UDP */
#define ETH_DMARXDESC_IPPT_TCP                      (0x00000002UL)  /*!< TCP */
#define ETH_DMARXDESC_IPPT_ICMP                     (0x00000003UL)  /*!< ICMP */

/**
 * @brief Bit definition of RDES6 register
 */
#define ETH_DMARXDESC_RTSL                          (0xFFFFFFFFUL)  /*!< Receive Time Stamp Low */

/**
 * @brief Bit definition of RDES7 register
 */
#define ETH_DMARXDESC_RTSH                          (0xFFFFFFFFUL)  /*!< Receive Time Stamp High */

/**
 * @}
 */

/**
 * @defgroup ETH_Auto_Negotiation ETH Auto Negotiation
 * @{
 */
#define ETH_AUTO_NEGOTIATION_DISABLE                (0x0000U)
#define ETH_AUTO_NEGOTIATION_ENABLE                 (0x0001U)
/**
 * @}
 */

/**
 * @defgroup ETH_Media_Interface ETH Media Interface
 * @{
 */
#define ETH_MAC_MEDIA_INTERFACE_MII                 (0UL)
#define ETH_MAC_MEDIA_INTERFACE_RMII                (ETH_MAC_IFCONFR_IFSEL)
/**
 * @}
 */

/**
 * @defgroup ETH_Speed ETH Speed
 * @{
 */
#define ETH_MAC_SPEED_10M                           (0UL)
#define ETH_MAC_SPEED_100M                          (ETH_MAC_CONFIGR_FES)
/**
 * @}
 */

/**
 * @defgroup ETH_Duplex_Mode ETH Duplex Mode
 * @{
 */
#define ETH_MAC_MODE_HALFDUPLEX                     (0UL)
#define ETH_MAC_MODE_FULLDUPLEX                     (ETH_MAC_CONFIGR_DM)
/**
 * @}
 */

/**
 * @defgroup ETH_Checksum_Mode ETH Checksum Mode
 * @{
 */
#define ETH_MAC_CHECKSUM_MODE_SOFTWARE              (0UL)
#define ETH_MAC_CHECKSUM_MODE_HARDWARE              (0x00000001UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_Mode ETH Rx Mode
 * @{
 */
#define ETH_RX_MODE_POLLING                         (0UL)
#define ETH_RX_MODE_INTERRUPT                       (0x00000001UL)
/**
 * @}
 */

/**
 * @defgroup ETH_TX_CLK_POLARITY ETH TX Clock Polarity
 * @{
 */
#define ETH_MAC_TX_CLK_POLARITY_KEEP                (0UL)
#define ETH_MAC_TX_CLK_POLARITY_INVERSE             (ETH_MAC_IFCONFR_TCKINV)
/**
 * @}
 */

/**
 * @defgroup ETH_RX_REF_CLK_POLARITY ETH RX/REF Clock Polarity
 * @{
 */
#define ETH_MAC_RX_REF_CLK_POLARITY_KEEP            (0UL)
#define ETH_MAC_RX_REF_CLK_POLARITY_INVERSE         (ETH_MAC_IFCONFR_RCKINV)
/**
 * @}
 */

/**
 * @defgroup ETH_SA_Insert_Mode ETH SA Insert Mode
 * @{
 */
#define ETH_MAC_SA_MODE_BY_DMATXDESC                (0UL)                                                 /*!< Configure the Insert mode by Tx Descriptor of DMA */
#define ETH_MAC_SA_MODE_INSTER_MACADDR0             (ETH_MAC_CONFIGR_SAIRC_1)                             /*!< Insert address value in MAC address register 0 into transmit frame as SA address */
#define ETH_MAC_SA_MODE_REPLACE_MACADDR0            (ETH_MAC_CONFIGR_SAIRC_1 | ETH_MAC_CONFIGR_SAIRC_0)   /*!< Replace SA address in transmit frame with address value in MAC address register 0 */
#define ETH_MAC_SA_MODE_INSTER_MACADDR1             (ETH_MAC_CONFIGR_SAIRC_2 | ETH_MAC_CONFIGR_SAIRC_1)   /*!< Insert address value in MAC address register 1 into transmit frame as SA address */
#define ETH_MAC_SA_MODE_REPLACE_MACADDR1            (ETH_MAC_CONFIGR_SAIRC)                               /*!< Replace SA address in transmit frame with address value in MAC address register 1 */
/**
 * @}
 */

/**
 * @defgroup ETH_TypeFrame_Strip_FCS ETH Type Frame Strip FCS
 * @{
 */
#define ETH_MAC_TYPEFRAME_STRIP_FCS_DISABLE         (0UL)
#define ETH_MAC_TYPEFRAME_STRIP_FCS_ENABLE          (ETH_MAC_CONFIGR_CST)
/**
 * @}
 */

/**
 * @defgroup ETH_Watchdog ETH Watchdog
 * @{
 */
#define ETH_MAC_WATCHDOG_DISABLE                    (ETH_MAC_CONFIGR_MWD)
#define ETH_MAC_WATCHDOG_ENABLE                     (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Jabber ETH Jabber
 * @{
 */
#define ETH_MAC_JABBER_DISABLE                      (ETH_MAC_CONFIGR_MJB)
#define ETH_MAC_JABBER_ENABLE                       (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Inter_Frame_Gap ETH Inter Frame Gap
 * @{
 */
#define ETH_MAC_INTERFRAME_GAP_96BIT                (0UL)
#define ETH_MAC_INTERFRAME_GAP_88BIT                (ETH_MAC_CONFIGR_IFG_0)
#define ETH_MAC_INTERFRAME_GAP_80BIT                (ETH_MAC_CONFIGR_IFG_1)
#define ETH_MAC_INTERFRAME_GAP_72BIT                (ETH_MAC_CONFIGR_IFG_1 | ETH_MAC_CONFIGR_IFG_0)
#define ETH_MAC_INTERFRAME_GAP_64BIT                (ETH_MAC_CONFIGR_IFG_2)
#define ETH_MAC_INTERFRAME_GAP_56BIT                (ETH_MAC_CONFIGR_IFG_2 | ETH_MAC_CONFIGR_IFG_0)
#define ETH_MAC_INTERFRAME_GAP_48BIT                (ETH_MAC_CONFIGR_IFG_2 | ETH_MAC_CONFIGR_IFG_1)
#define ETH_MAC_INTERFRAME_GAP_40BIT                (ETH_MAC_CONFIGR_IFG)
/**
 * @}
 */

/**
 * @defgroup ETH_Carrier_Sense ETH Carrier Sense
 * @{
 */
#define ETH_MAC_CARRIER_SENCE_DISABLE               (ETH_MAC_CONFIGR_DCRS)
#define ETH_MAC_CARRIER_SENCE_ENABLE                (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Own ETH Receive Own
 * @{
 */
#define ETH_MAC_RECEIVE_OWN_DISABLE                 (ETH_MAC_CONFIGR_DO)
#define ETH_MAC_RECEIVE_OWN_ENABLE                  (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Checksum_Offload ETH Checksum Offload
 * @{
 */
#define ETH_MAC_CHECKSUM_OFFLAOD_DISABLE            (0UL)
#define ETH_MAC_CHECKSUM_OFFLAOD_ENABLE             (ETH_MAC_CONFIGR_IPCO)
/**
 * @}
 */

/**
 * @defgroup ETH_Retry_Transmit ETH Retry Transmit
 * @{
 */
#define ETH_MAC_RETRY_TRANSMIT_DISABLE              (ETH_MAC_CONFIGR_DRTY)
#define ETH_MAC_RETRY_TRANSMIT_ENABLE               (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Auto_Strip_Pad_FCS ETH Auto Strip Pad FCS
 * @{
 */
#define ETH_MAC_AUTO_STRIP_PAD_FCS_DISABLE          (0UL)
#define ETH_MAC_AUTO_STRIP_PAD_FCS_ENABLE           (ETH_MAC_CONFIGR_ACS)
/**
 * @}
 */

/**
 * @defgroup ETH_Back_Off_Limit ETH Back Off Limit
 * @{
 */
#define ETH_MAC_BACKOFF_LIMIT_10                    (0UL)
#define ETH_MAC_BACKOFF_LIMIT_8                     (ETH_MAC_CONFIGR_BL_0)
#define ETH_MAC_BACKOFF_LIMIT_4                     (ETH_MAC_CONFIGR_BL_1)
#define ETH_MAC_BACKOFF_LIMIT_1                     (ETH_MAC_CONFIGR_BL)
/**_
 * @}
 */

/**
 * @defgroup ETH_Deferral_Check ETH Deferral Check
 * @{
 */
#define ETH_MAC_DEFFERRAL_CHECK_DISABLE             (0UL)
#define ETH_MAC_DEFFERRAL_CHECK_ENABLE              (ETH_MAC_CONFIGR_DC)
/**
 * @}
 */

/**
 * @defgroup ETH_Zero_Quanta_Pause ETH Zero Quanta Pause
 * @{
 */
#define ETH_MAC_ZERO_QUANTA_PAUSE_DISABLE           (ETH_MAC_FLOCTLR_DZPQ)
#define ETH_MAC_ZERO_QUANTA_PAUSE_ENABLE            (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Pause_Low_Threshold ETH Pause Low Threshold
 * @{
 */
#define ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS4           (0UL)                     /*!< Pause time minus 4 slot times */
#define ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS28          (ETH_MAC_FLOCTLR_PLT_0)   /*!< Pause time minus 28 slot times */
#define ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS144         (ETH_MAC_FLOCTLR_PLT_1)   /*!< Pause time minus 144 slot times */
#define ETH_MAC_PAUSE_LOWTHRESHOLD_MINUS256         (ETH_MAC_FLOCTLR_PLT)     /*!< Pause time minus 256 slot times */
/**
 * @}
 */

/**
 * @defgroup ETH_Unicast_Pause_Frame_Detect ETH Unicast Pause Frame Detect
 * @{
 */
#define ETH_MAC_UNICAST_PAUSEFRAME_DETECT_DISABLE   (0UL)
#define ETH_MAC_UNICAST_PAUSEFRAME_DETECT_ENABLE    (ETH_MAC_FLOCTLR_UNP)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Flow_Control ETH Receive Flow Control
 * @{
 */
#define ETH_MAC_RECEIVE_FLOWCONTROL_DISABLE         (0UL)
#define ETH_MAC_RECEIVE_FLOWCONTROL_ENABLE          (ETH_MAC_FLOCTLR_RFE)
/**
 * @}
 */

/**
 * @defgroup ETH_Transmit_Flow_Control ETH Transmit Flow Control
 * @{
 */
#define ETH_MAC_TRANSMIT_FLOWCONTROL_DISABLE        (0UL)
#define ETH_MAC_TRANSMIT_FLOWCONTROL_ENABLE         (ETH_MAC_FLOCTLR_TFE)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_All ETH Receive All
 * @{
 */
#define ETH_MAC_RECEIVE_All_DISABLE                 (0UL)
#define ETH_MAC_RECEIVE_ALL_ENABLE                  (ETH_MAC_FLTCTLR_RA)
/**
 * @}
 */

/**
 * @defgroup ETH_Drop_Not_TcpUdp ETH Drop Not TcpUdp
 * @{
 */
#define ETH_MAC_DROP_NOT_TCPUDP_DISABLE             (0UL)
#define ETH_MAC_DROP_NOT_TCPUDP_ENABLE              (ETH_MAC_FLTCTLR_DNTU)
/**
 * @}
 */

/**
 * @defgroup ETH_VLAN_Tag_Filter ETH VLAN Tag Filter
 * @{
 */
#define ETH_MAC_VLAN_TAG_FILTER_DISABLE             (0UL)
#define ETH_MAC_VLAN_TAG_FILTER_ENABLE              (ETH_MAC_FLTCTLR_VTFE)
/**
 * @}
 */

/**
 * @defgroup ETH_Source_Addr_Filter ETH Source Addr Filter
 * @{
 */
#define ETH_MAC_SOURCE_ADDR_FILTER_DISABLE          (0UL)
#define ETH_MAC_SOURCE_ADDR_FILTER_NORMAL           (ETH_MAC_FLTCTLR_SAF)
#define ETH_MAC_SOURCE_ADDR_FILTER_INVERSE          (ETH_MAC_FLTCTLR_SAF | ETH_MAC_FLTCTLR_SAIF)
/**
 * @}
 */

/**
 * @defgroup ETH_Pass_Control_Frame ETH Pass Control Frame
 * @{
 */
#define ETH_MAC_PASS_CTRLFRAME_BLOCK_ALL                    (0UL)                     /*!< MAC filter all control frame from reaching the application */
#define ETH_MAC_PASS_CTRLFRAME_FORWARD_NOTPAUSE_ALL         (ETH_MAC_FLTCTLR_PCF_0)   /*!< MAC forward all control frame except pause control frame to application even if they fail the address filter */
#define ETH_MAC_PASS_CTRLFRAME_FORWARD_ALL                  (ETH_MAC_FLTCTLR_PCF_1)   /*!< MAC forward all control frame to application even if they fail the address filter */
#define ETH_MAC_PASS_CTRLFRAME_FORWARD_PASSADDRFILTER       (ETH_MAC_FLTCTLR_PCF)     /*!< MAC forward control frame that pass the address filter. */
/**
 * @}
 */

/**
 * @defgroup ETH_Broadcast_Frame_Reception ETH Broadcast Frame Reception
 * @{
 */
#define ETH_MAC_BROADCASTFRAME_RECEPTION_DISABLE    (ETH_MAC_FLTCTLR_DBF)
#define ETH_MAC_BROADCASTFRAME_RECEPTION_ENABLE     (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Destination_Addr_Filter ETH Destination Addr Filter
 * @{
 */
#define ETH_MAC_DESTINATION_ADDR_FILTER_NORMAL      (0UL)
#define ETH_MAC_DESTINATION_ADDR_FILTER_INVERSE     (ETH_MAC_FLTCTLR_DAIF)
/**
 * @}
 */

/**
 * @defgroup ETH_Multicast_Frame_Filter ETH Multicast Frame Filter
 * @{
 */
#define ETH_MAC_MULTICASTFRAME_FILTER_NONE                  (ETH_MAC_FLTCTLR_PMF)
#define ETH_MAC_MULTICASTFRAME_FILTER_PERFECT               (0UL)
#define ETH_MAC_MULTICASTFRAME_FILTER_HASHTABLE             (ETH_MAC_FLTCTLR_HMC)
#define ETH_MAC_MULTICASTFRAME_FILTER_PERFECTHASHTABLE      (ETH_MAC_FLTCTLR_HPF | ETH_MAC_FLTCTLR_HMC)
/**
 * @}
 */

/**
 * @defgroup ETH_Unicast_Frame_Filter ETH Unicast Frame Filter
 * @{
 */
#define ETH_MAC_UNICASTFRAME_FILTER_PERFECT                 (0UL)
#define ETH_MAC_UNICASTFRAME_FILTER_HASHTABLE               (ETH_MAC_FLTCTLR_HUC)
#define ETH_MAC_UNICASTFRAME_FILTER_PERFECTHASHTABLE        (ETH_MAC_FLTCTLR_HPF | ETH_MAC_FLTCTLR_HUC)
/**
 * @}
 */

/**
 * @defgroup ETH_Promiscuous_Mode ETH Promiscuous Mode
 * @{
 */
#define ETH_MAC_PROMISCUOUS_MODE_DISABLE            (0UL)
#define ETH_MAC_PROMISCUOUS_MODE_ENABLE             (ETH_MAC_FLTCTLR_PR)
/**
 * @}
 */

/**
 * @defgroup ETH_Tx_VLAN_Insert_Mode ETH Tx VLAN Insert Mode
 * @{
 */
#define ETH_MAC_TXVLAN_MODE_BY_DMATXDESC            (0UL)                                               /*!< Configure the Tx VLAN mode by Tx Descriptor of DMA */
#define ETH_MAC_TXVLAN_MODE_BYPASS                  (ETH_MAC_VTACTLR_VLANS)                             /*!< Do Nothing: VLAN Insertion is bypassed */
#define ETH_MAC_TXVLAN_MODE_REMOVE_TAG              (ETH_MAC_VTACTLR_VLANS | ETH_MAC_VTACTLR_VLANC_0)   /*!< Remove Tag and Type fields in VLAN frame */
#define ETH_MAC_TXVLAN_MODE_INSERT_TAG              (ETH_MAC_VTACTLR_VLANS | ETH_MAC_VTACTLR_VLANC_1)   /*!< Insert VLAN Tag value in ETH_MAC_VTACTLR Register into transmit frame */
#define ETH_MAC_TXVLAN_MODE_REPLACE_TAG             (ETH_MAC_VTACTLR_VLANS | ETH_MAC_VTACTLR_VLANC)     /*!< Replace VLAN tag value in transmit frame with VLAN tag value in ETH_MAC_VTACTLR register */
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_VLAN_Filter ETH Rx VLAN Filter
 * @{
 */
#define ETH_MAC_RXVLAN_FILTER_NORMAL                (0UL)
#define ETH_MAC_RXVLAN_FILTER_INVERSE               (ETH_MAC_VTAFLTR_VTIM)
#define ETH_MAC_RXVLAN_FILTER_NORMAL_HASHTABLE      (ETH_MAC_VTAFLTR_VTHM)
#define ETH_MAC_RXVLAN_FILTER_INVERSE_HASHTABLE     (ETH_MAC_VTAFLTR_VTHM | ETH_MAC_VTAFLTR_VTIM)
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_VLAN_Comparison ETH Rx VLAN Comparison
 * @{
 */
#define ETH_MAC_RXVLAN_COMPARISON_16BIT             (0UL)
#define ETH_MAC_RXVLAN_COMPARISON_12BIT             (ETH_MAC_VTAFLTR_VTAL)
/**
 * @}
 */

/**
 * @defgroup ETH_L4_Dest_Port_Filter ETH L4 Dest Port Filter
 * @{
 */
#define ETH_MAC_L4_DESTPORT_FILTER_DISABLE          (0UL)
#define ETH_MAC_L4_DESTPORT_FILTER_NORMAL           (ETH_MAC_L34CTLR_L4DPM)
#define ETH_MAC_L4_DESTPORT_FILTER_INVERSE          (ETH_MAC_L34CTLR_L4DPIM | ETH_MAC_L34CTLR_L4DPM)
/**
 * @}
 */

/**
 * @defgroup ETH_L4_Source_Port_Filter ETH L4 Source Port Filter
 * @{
 */
#define ETH_MAC_L4_SOURCEPORT_FILTER_DISABLE        (0UL)
#define ETH_MAC_L4_SOURCEPORT_FILTER_NORMAL         (ETH_MAC_L34CTLR_L4SPM)
#define ETH_MAC_L4_SOURCEPORT_FILTER_INVERSE        (ETH_MAC_L34CTLR_L4SPIM | ETH_MAC_L34CTLR_L4SPM)
/**
 * @}
 */

/**
 * @defgroup ETH_L4_Port_Filter_Protocol ETH L4 Port Filter Protocol
 * @{
 */
#define ETH_MAC_L4_PORT_FILTER_PROTOCOL_TCP         (0UL)                     /*!< Port filter for TCP frame */
#define ETH_MAC_L4_PORT_FILTER_PROTOCOL_UDP         (ETH_MAC_L34CTLR_L4PEN)   /*!< Port filter for UDP frame */
/**
 * @}
 */

