RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
/**
 * @defgroup ETH_L3_Dest_Addr_Filter_Mask ETH L3 Destination Addr Filter Mask
 * @note The following definitions apply to IPv4
 * @{
 */
#define ETH_MAC_L3_DA_FILTER_MASK_NONE              (0x00000000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT0              (0x00000800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT1_0            (0x00001000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT2_0            (0x00001800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT3_0            (0x00002000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT4_0            (0x00002800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT5_0            (0x00003000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT6_0            (0x00003800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT7_0            (0x00004000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT8_0            (0x00004800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT9_0            (0x00005000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT10_0           (0x00005800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT11_0           (0x00006000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT12_0           (0x00006800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT13_0           (0x00007000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT14_0           (0x00007800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT15_0           (0x00008000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT16_0           (0x00008800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT17_0           (0x00009000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT18_0           (0x00009800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT19_0           (0x0000A000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT20_0           (0x0000A800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT21_0           (0x0000B000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT22_0           (0x0000B800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT23_0           (0x0000C000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT24_0           (0x0000C800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT25_0           (0x0000D000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT26_0           (0x0000D800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT27_0           (0x0000E000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT28_0           (0x0000E800UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT29_0           (0x0000F000UL)
#define ETH_MAC_L3_DA_FILTER_MASK_BIT30_0           (0x0000F800UL)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Source_Addr_Filter_Mask ETH L3 Source Addr Filter Mask
 * @note The following definitions apply to IPv4
 * @{
 */
#define ETH_MAC_L3_SA_FILTER_MASK_NONE              (0x00000000UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT0              (0x00000040UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT1_0            (0x00000080UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT2_0            (0x000000C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT3_0            (0x00000100UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT4_0            (0x00000140UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT5_0            (0x00000180UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT6_0            (0x000001C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT7_0            (0x00000200UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT8_0            (0x00000240UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT9_0            (0x00000280UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT10_0           (0x000002C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT11_0           (0x00000300UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT12_0           (0x00000340UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT13_0           (0x00000380UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT14_0           (0x000003C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT15_0           (0x00000400UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT16_0           (0x00000440UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT17_0           (0x00000480UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT18_0           (0x000004C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT19_0           (0x00000500UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT20_0           (0x00000540UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT21_0           (0x00000580UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT22_0           (0x000005C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT23_0           (0x00000600UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT24_0           (0x00000640UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT25_0           (0x00000680UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT26_0           (0x000006C0UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT27_0           (0x00000700UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT28_0           (0x00000740UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT29_0           (0x00000780UL)
#define ETH_MAC_L3_SA_FILTER_MASK_BIT30_0           (0x000007C0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_DA_SA_Filter_Mask ETH L3 DA SA Filter Mask
 * @note The following definitions apply to IPv6.
 * @{
 */
#define ETH_MAC_L3_DA_SA_FILTER_MASK_NONE           (0x00000000UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT0           (0x00000040UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT1_0         (0x00000080UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT2_0         (0x000000C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT3_0         (0x00000100UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT4_0         (0x00000140UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT5_0         (0x00000180UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT6_0         (0x000001C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT7_0         (0x00000200UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT8_0         (0x00000240UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT9_0         (0x00000280UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT10_0        (0x000002C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT11_0        (0x00000300UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT12_0        (0x00000340UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT13_0        (0x00000380UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT14_0        (0x000003C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT15_0        (0x00000400UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT16_0        (0x00000440UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT17_0        (0x00000480UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT18_0        (0x000004C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT19_0        (0x00000500UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT20_0        (0x00000540UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT21_0        (0x00000580UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT22_0        (0x000005C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT23_0        (0x00000600UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT24_0        (0x00000640UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT25_0        (0x00000680UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT26_0        (0x000006C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT27_0        (0x00000700UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT28_0        (0x00000740UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT29_0        (0x00000780UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT30_0        (0x000007C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT31_0        (0x00000800UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT32_0        (0x00000840UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT33_0        (0x00000880UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT34_0        (0x000008C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT35_0        (0x00000900UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT36_0        (0x00000940UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT37_0        (0x00000980UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT38_0        (0x000009C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT39_0        (0x00000A00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT40_0        (0x00000A40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT41_0        (0x00000A80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT42_0        (0x00000AC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT43_0        (0x00000B00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT44_0        (0x00000B40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT45_0        (0x00000B80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT46_0        (0x00000BC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT47_0        (0x00000C00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT48_0        (0x00000C40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT49_0        (0x00000C80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT50_0        (0x00000CC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT51_0        (0x00000D00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT52_0        (0x00000D40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT53_0        (0x00000D80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT54_0        (0x00000DC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT55_0        (0x00000E00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT56_0        (0x00000E40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT57_0        (0x00000E80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT58_0        (0x00000EC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT59_0        (0x00000F00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT60_0        (0x00000F40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT61_0        (0x00000F80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT62_0        (0x00000FC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT63_0        (0x00001000UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT64_0        (0x00001040UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT65_0        (0x00001080UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT66_0        (0x000010C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT67_0        (0x00001100UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT68_0        (0x00001140UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT69_0        (0x00001180UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT70_0        (0x000011C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT71_0        (0x00001200UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT72_0        (0x00001240UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT73_0        (0x00001280UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT74_0        (0x000012C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT75_0        (0x00001300UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT76_0        (0x00001340UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT77_0        (0x00001380UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT78_0        (0x000013C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT79_0        (0x00001400UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT80_0        (0x00001440UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT81_0        (0x00001480UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT82_0        (0x000014C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT83_0        (0x00001500UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT84_0        (0x00001540UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT85_0        (0x00001580UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT86_0        (0x000015C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT87_0        (0x00001600UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT88_0        (0x00001640UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT89_0        (0x00001680UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT90_0        (0x000016C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT91_0        (0x00001700UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT92_0        (0x00001740UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT93_0        (0x00001780UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT94_0        (0x000017C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT95_0        (0x00001800UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT96_0        (0x00001840UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT97_0        (0x00001880UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT98_0        (0x000018C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT99_0        (0x00001900UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT100_0       (0x00001940UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT101_0       (0x00001980UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT102_0       (0x000019C0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT103_0       (0x00001A00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT104_0       (0x00001A40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT105_0       (0x00001A80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT106_0       (0x00001AC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT107_0       (0x00001B00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT108_0       (0x00001B40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT109_0       (0x00001B80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT110_0       (0x00001BC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT111_0       (0x00001C00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT112_0       (0x00001C40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT113_0       (0x00001C80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT114_0       (0x00001CC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT115_0       (0x00001D00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT116_0       (0x00001D40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT117_0       (0x00001D80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT118_0       (0x00001DC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT119_0       (0x00001E00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT120_0       (0x00001E40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT121_0       (0x00001E80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT122_0       (0x00001EC0UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT123_0       (0x00001F00UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT124_0       (0x00001F40UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT125_0       (0x00001F80UL)
#define ETH_MAC_L3_DA_SA_FILTER_MASK_BIT126_0       (0x00001FC0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Dest_Addr_Filter ETH L3 Destination Addr Filter
 * @{
 */
#define ETH_MAC_L3_DA_FILTER_DISABLE                (0UL)
#define ETH_MAC_L3_DA_FILTER_NORMAL                 (ETH_MAC_L34CTLR_L3DAM)
#define ETH_MAC_L3_DA_FILTER_INVERSE                (ETH_MAC_L34CTLR_L3DAIM | ETH_MAC_L34CTLR_L3DAM)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Source_Addr_Filter ETH L3 Source Addr Filter
 * @{
 */
#define ETH_MAC_L3_SA_FILTER_DISABLE                (0UL)
#define ETH_MAC_L3_SA_FILTER_NORMAL                 (ETH_MAC_L34CTLR_L3SAM)
#define ETH_MAC_L3_SA_FILTER_INVERSE                (ETH_MAC_L34CTLR_L3SAIM | ETH_MAC_L34CTLR_L3SAM)
/**
 * @}
 */

/**
 * @defgroup ETH_L3_Addr_Filter_Protocol ETH L3 Addr Filter Protocol
 * @{
 */
#define ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4        (0UL)                     /*!< Ip Address filter for IPv4 */
#define ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV6        (ETH_MAC_L34CTLR_L3PEN)   /*!< Ip Address filter for IPv6 */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Address_Index ETH MAC Address Index
 * @{
 */
#define ETH_MAC_ADDRESS0                            (0x00000000UL)
#define ETH_MAC_ADDRESS1                            (0x00000008UL)
#define ETH_MAC_ADDRESS2                            (0x00000010UL)
#define ETH_MAC_ADDRESS3                            (0x00000018UL)
#define ETH_MAC_ADDRESS4                            (0x00000020UL)
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Address_Filter ETH MAC Address Filter
 * @note The parameter is invalid in ETH_MAC_ADDRESS0.
 * @{
 */
#define ETH_MAC_ADDRESS_FILTER_DISABLE              (0UL)                                           /*!< Disable perfect filter with MAC address. */
#define ETH_MAC_ADDRESS_FILTER_PERFECT_DA           (ETH_MAC_MACADHR1_AE1)                          /*!< Filter the DA address of the received frame with MAC address. */
#define ETH_MAC_ADDRESS_FILTER_PERFECT_SA           (ETH_MAC_MACADHR1_AE1 | ETH_MAC_MACADHR1_SA1)   /*!< Filter the SA address of the received frame with MAC address. */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Address_Filter_Mask ETH MAC Address Filter Mask
 * @note The parameter is invalid in ETH_MAC_ADDRESS0.
 * @{
 */
#define ETH_MAC_ADDRESS_MASK_DISABLE                (0UL)                       /*!< Disable MAC Address Mask */
#define ETH_MAC_ADDRESS_MASK_BYTE6                  (ETH_MAC_MACADHR1_MBC1_5)   /*!< Mask MAC Address high reg bits [15:8] */
#define ETH_MAC_ADDRESS_MASK_BYTE5                  (ETH_MAC_MACADHR1_MBC1_4)   /*!< Mask MAC Address high reg bits [7:0] */
#define ETH_MAC_ADDRESS_MASK_BYTE4                  (ETH_MAC_MACADHR1_MBC1_3)   /*!< Mask MAC Address low reg bits [31:24] */
#define ETH_MAC_ADDRESS_MASK_BYTE3                  (ETH_MAC_MACADHR1_MBC1_2)   /*!< Mask MAC Address low reg bits [23:16] */
#define ETH_MAC_ADDRESS_MASK_BYTE2                  (ETH_MAC_MACADHR1_MBC1_1)   /*!< Mask MAC Address low reg bits [15:8] */
#define ETH_MAC_ADDRESS_MASK_BYTE1                  (ETH_MAC_MACADHR1_MBC1_0)   /*!< Mask MAC Address low reg bits [7:0] */
#define ETH_MAC_ADDRESS_MASK_ALL                    (ETH_MAC_MACADHR1_MBC1)     /*!< Mask MAC Address low reg bits [31:0] and low high bits [15:0] */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_INT_Flag ETH MAC Interrupt Flag
 * @{
 */
#define ETH_MAC_INT_FLAG_TSPIS                      (ETH_MAC_INTSTSR_TSPIS)     /*!< Time stamp trigger flag (on MAC) */
#define ETH_MAC_INT_FLAG_MMCTXIS                    (ETH_MAC_INTSTSR_MMCTXIS)   /*!< MMC transmit flag  */
#define ETH_MAC_INT_FLAG_MMCRXIS                    (ETH_MAC_INTSTSR_MMCRXIS)   /*!< MMC receive flag */
#define ETH_MAC_INT_FLAG_MMCIS                      (ETH_MAC_INTSTSR_MMCIS)     /*!< MMC flag (on MAC) */
#define ETH_MAC_INT_FLAG_PMTIS                      (ETH_MAC_INTSTSR_PMTIS)     /*!< PMT flag (on MAC) */
/**
 * @}
 */

/**
 * @defgroup ETH_MAC_Interrupt ETH MAC Interrupt
 * @{
 */
#define ETH_MAC_INT_TSPIM                           (ETH_MAC_INTMSKR_TSPIM)   /*!< Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_INT_PMTIM                           (ETH_MAC_INTMSKR_PMTIM)   /*!< PMT interrupt (on MAC) */
/**
 * @}
 */

/**
 * @defgroup ETH_Burst_Mode ETH Burst Mode
 * @{
 */
#define ETH_DMA_BURST_MODE_NORMAL                   (0UL)                     /*!< DMA master interface only use SINGLE and INCR access type */
#define ETH_DMA_BURST_MODE_FIXED                    (ETH_DMA_BUSMODR_FBST)    /*!< DMA master interface use SINGLE and INCR, INCR8, INCR16 access type */
#define ETH_DMA_BURST_MODE_MIXED                    (ETH_DMA_BUSMODR_MBST)    /*!< DMA master interface will start all burst transmission with INCR length greater than 16 */
/**
 * @}
 */

/**
 * @defgroup ETH_Address_Align ETH Address Align
 * @{
 */
#define ETH_DMA_ADDRESS_ALIGN_DISABLE               (0UL)
#define ETH_DMA_ADDRESS_ALIGN_ENABLE                (ETH_DMA_BUSMODR_AAL)
/**
 * @}
 */

/**
 * @defgroup ETH_Rx_DMA_Burst_Length ETH Rx DMA Burst Length
 * @{
 */
#define ETH_DMA_RX_BURST_LENGTH_1BEAT               (ETH_DMA_BUSMODR_RPBL_0)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 1 */
#define ETH_DMA_RX_BURST_LENGTH_2BEAT               (ETH_DMA_BUSMODR_RPBL_1)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 2 */
#define ETH_DMA_RX_BURST_LENGTH_4BEAT               (ETH_DMA_BUSMODR_RPBL_2)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMA_RX_BURST_LENGTH_8BEAT               (ETH_DMA_BUSMODR_RPBL_3)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMA_RX_BURST_LENGTH_16BEAT              (ETH_DMA_BUSMODR_RPBL_4)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMA_RX_BURST_LENGTH_32BEAT              (ETH_DMA_BUSMODR_RPBL_5)                          /*!< Maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMA_RX_BURST_LENGTH_8XPBL_8BEAT         (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_0)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMA_RX_BURST_LENGTH_8XPBL_16BEAT        (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_1)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMA_RX_BURST_LENGTH_8XPBL_32BEAT        (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_2)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMA_RX_BURST_LENGTH_8XPBL_64BEAT        (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_3)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 64 */
#define ETH_DMA_RX_BURST_LENGTH_8XPBL_128BEAT       (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_4)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 128 */
#define ETH_DMA_RX_BURST_LENGTH_8XPBL_256BEAT       (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_RPBL_5)  /*!< Maximum number of beats to be transferred in one RxDMA transaction is 256 */
/**
 * @}
 */

/**
 * @defgroup ETH_Tx_DMA_Burst_Length ETH Tx DMA Burst Length
 * @{
 */
#define ETH_DMA_TX_BURST_LENGTH_1BEAT               (ETH_DMA_BUSMODR_TPBL_0)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_DMA_TX_BURST_LENGTH_2BEAT               (ETH_DMA_BUSMODR_TPBL_1)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_DMA_TX_BURST_LENGTH_4BEAT               (ETH_DMA_BUSMODR_TPBL_2)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMA_TX_BURST_LENGTH_8BEAT               (ETH_DMA_BUSMODR_TPBL_3)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMA_TX_BURST_LENGTH_16BEAT              (ETH_DMA_BUSMODR_TPBL_4)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMA_TX_BURST_LENGTH_32BEAT              (ETH_DMA_BUSMODR_TPBL_5)                          /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMA_TX_BURST_LENGTH_8XPBL_8BEAT         (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_0)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMA_TX_BURST_LENGTH_8XPBL_16BEAT        (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_1)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMA_TX_BURST_LENGTH_8XPBL_32BEAT        (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_2)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMA_TX_BURST_LENGTH_8XPBL_64BEAT        (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_3)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_DMA_TX_BURST_LENGTH_8XPBL_128BEAT       (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_4)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */
#define ETH_DMA_TX_BURST_LENGTH_8XPBL_256BEAT       (ETH_DMA_BUSMODR_M8PBL | ETH_DMA_BUSMODR_TPBL_5)  /*!< Maximum number of beats to be transferred in one TxDMA (or both) transaction is 256 */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Enhance_Descriptor ETH DMA Enhance Descriptor
 * @{
 */
#define ETH_DMA_ENHANCE_DESCRIPTOR_DISABLE          (0UL)
#define ETH_DMA_ENHANCE_DESCRIPTOR_ENABLE           (ETH_DMA_BUSMODR_DSEN)
/**
 * @}
 */

