RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
/**
 * @defgroup ETH_DMA_Arbitration ETH DMA Arbitration
 * @{
 */
#define ETH_DMA_ARBITRATION_LOOP_RXTX_1_1           (0UL)
#define ETH_DMA_ARBITRATION_LOOP_RXTX_2_1           (ETH_DMA_BUSMODR_PRAT_0)
#define ETH_DMA_ARBITRATION_LOOP_RXTX_3_1           (ETH_DMA_BUSMODR_PRAT_1)
#define ETH_DMA_ARBITRATION_LOOP_RXTX_4_1           (ETH_DMA_BUSMODR_PRAT)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_1_1           (ETH_DMA_BUSMODR_TXPR)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_2_1           (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT_0)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_3_1           (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT_1)
#define ETH_DMA_ARBITRATION_LOOP_TXRX_4_1           (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT)
#define ETH_DMA_ARBITRATION_FIXED_RXPRIORTX         (ETH_DMA_BUSMODR_DMAA)
#define ETH_DMA_ARBITRATION_FIXED_TXPRIORRX         (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_DMAA)
/**
 * @}
 */

/**
 * @defgroup ETH_Drop_TCPIP_Checksum_Error_Frame ETH Drop TCPIP Checksum Error Frame
 * @{
 */
#define ETH_DMA_DROP_CHECKSUM_ERRORFRAME_DISABLE    (ETH_DMA_OPRMODR_DTCOE)
#define ETH_DMA_DROP_CHECKSUM_ERRORFRAME_ENABLE     (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Store_Forward ETH Receive Store Forward
 * @{
 */
#define ETH_DMA_RECEIVE_STORE_FORWARD_DISABLE       (0UL)
#define ETH_DMA_RECEIVE_STORE_FORWARD_ENABLE        (ETH_DMA_OPRMODR_RSF)
/**
 * @}
 */

/**
 * @defgroup ETH_Flush_Receive_Frame ETH Flush Receive Frame
 * @{
 */
#define ETH_DMA_FLUSH_RECEIVEDFRAME_DISABLE         (ETH_DMA_OPRMODR_DFRF)
#define ETH_DMA_FLUSH_RECEIVEDFRAME_ENABLE          (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_Transmit_Store_Forward ETH Transmit Store Forward
 * @{
 */
#define ETH_DMA_TRANSMIT_STORE_FORWARD_DISABLE      (0UL)
#define ETH_DMA_TRANSMIT_STORE_FORWARD_ENABLE       (ETH_DMA_OPRMODR_TSF)
/**
 * @}
 */

/**
 * @defgroup ETH_Transmit_Threshold ETH Transmit Threshold
 * @{
 */
#define ETH_DMA_TRANSMIT_THRESHOLD_64BYTE           (0UL)                                             /*!< Threshold level of the Transmit FIFO is 64 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_128BYTE          (ETH_DMA_OPRMODR_TTC_0)                           /*!< Threshold level of the Transmit FIFO is 128 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_192BYTE          (ETH_DMA_OPRMODR_TTC_1)                           /*!< Threshold level of the Transmit FIFO is 192 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_256BYTE          (ETH_DMA_OPRMODR_TTC_1 | ETH_DMA_OPRMODR_TTC_0)   /*!< Threshold level of the Transmit FIFO is 256 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_40BYTE           (ETH_DMA_OPRMODR_TTC_2)                           /*!< Threshold level of the Transmit FIFO is 40 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_32BYTE           (ETH_DMA_OPRMODR_TTC_2 | ETH_DMA_OPRMODR_TTC_0)   /*!< Threshold level of the Transmit FIFO is 32 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_24BYTE           (ETH_DMA_OPRMODR_TTC_2 | ETH_DMA_OPRMODR_TTC_1)   /*!< Threshold level of the Transmit FIFO is 24 Bytes */
#define ETH_DMA_TRANSMIT_THRESHOLD_16BYTE           (ETH_DMA_OPRMODR_TTC)                             /*!< Threshold level of the Transmit FIFO is 16 Bytes */
/**
 * @}
 */

/**
 * @defgroup ETH_Forward_Error_Frame ETH Forward Error Frame
 * @{
 */
#define ETH_DMA_FORWARD_ERRORFRAME_DISABLE          (0UL)
#define ETH_DMA_FORWARD_ERRORFRAME_ENABLE           (ETH_DMA_OPRMODR_FEF)
/**
 * @}
 */

/**
 * @defgroup ETH_Forward_Undersize_Good_Frame ETH Forward Undersize Good Frame
 * @{
 */
#define ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME_DISABLE (0UL)
#define ETH_DMA_FORWARD_UNDERSIZE_GOODFRAME_ENABLE  (ETH_DMA_OPRMODR_FUF)
/**
 * @}
 */

/**
 * @defgroup ETH_Drop_Jumbo_Frame ETH Drop Jumbo Frame
 * @{
 */
#define ETH_DMA_DROP_JUMBO_FRAME_DISABLE            (0UL)
#define ETH_DMA_DROP_JUMBO_FRAME_ENABLE             (ETH_DMA_OPRMODR_DGF)
/**
 * @}
 */

/**
 * @defgroup ETH_Receive_Threshold ETH Receive Threshold
 * @{
 */
#define ETH_DMA_RECEIVE_THRESHOLD_64BYTE            (0UL)                     /*!< Threshold level of the Receive FIFO is 64 Bytes */
#define ETH_DMA_RECEIVE_THRESHOLD_32BYTE            (ETH_DMA_OPRMODR_RTC_0)   /*!< Threshold level of the Receive FIFO is 32 Bytes */
#define ETH_DMA_RECEIVE_THRESHOLD_96BYTE            (ETH_DMA_OPRMODR_RTC_1)   /*!< Threshold level of the Receive FIFO is 96 Bytes */
#define ETH_DMA_RECEIVE_THRESHOLD_128BYTE           (ETH_DMA_OPRMODR_RTC)     /*!< Threshold level of the Receive FIFO is 128 Bytes */
/**
 * @}
 */

/**
 * @defgroup ETH_Second_Frame_Operate ETH Second Frame Operate
 * @{
 */
#define ETH_DMA_SECONDFRAME_OPERARTE_DISABLE        (0UL)
#define ETH_DMA_SECONDFRAME_OPERARTE_ENABLE         (ETH_DMA_OPRMODR_OSF)
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Flag ETH DMA Flag
 * @{
 */
#define ETH_DMA_FLAG_PTPS                           (ETH_DMA_DMASTSR_PTPS)  /*!< Time-stamp trigger status */
#define ETH_DMA_FLAG_PMTS                           (ETH_DMA_DMASTSR_PMTS)  /*!< PMT trigger status */
#define ETH_DMA_FLAG_MMCS                           (ETH_DMA_DMASTSR_MMCS)  /*!< MMC trigger status */
#define ETH_DMA_FLAG_EBUS                           (ETH_DMA_DMASTSR_EBUS)  /*!< Error state bits  */
#define ETH_DMA_FLAG_TSTS                           (ETH_DMA_DMASTSR_TSTS)  /*!< Transmit state */
#define ETH_DMA_FLAG_RSTS                           (ETH_DMA_DMASTSR_RSTS)  /*!< Receive state */
#define ETH_DMA_FLAG_NIS                            (ETH_DMA_DMASTSR_NIS)   /*!< Normal interrupt summary flag */
#define ETH_DMA_FLAG_AIS                            (ETH_DMA_DMASTSR_AIS)   /*!< Abnormal interrupt summary flag */
#define ETH_DMA_FLAG_ERS                            (ETH_DMA_DMASTSR_ERS)   /*!< Early receive flag */
#define ETH_DMA_FLAG_FBS                            (ETH_DMA_DMASTSR_FBS)   /*!< Fatal bus error flag */
#define ETH_DMA_FLAG_ETS                            (ETH_DMA_DMASTSR_ETS)   /*!< Early transmit flag */
#define ETH_DMA_FLAG_RWS                            (ETH_DMA_DMASTSR_RWS)   /*!< Receive watchdog timeout flag */
#define ETH_DMA_FLAG_RSS                            (ETH_DMA_DMASTSR_RSS)   /*!< Receive stopped flag */
#define ETH_DMA_FLAG_RUS                            (ETH_DMA_DMASTSR_RUS)   /*!< Receive buffer unavailable flag */
#define ETH_DMA_FLAG_RIS                            (ETH_DMA_DMASTSR_RIS)   /*!< Receive flag */
#define ETH_DMA_FLAG_UNS                            (ETH_DMA_DMASTSR_UNS)   /*!< Transmit Underflow flag */
#define ETH_DMA_FLAG_OVS                            (ETH_DMA_DMASTSR_OVS)   /*!< Receive Overflow flag */
#define ETH_DMA_FLAG_TJS                            (ETH_DMA_DMASTSR_TJS)   /*!< Transmit jabber timeout flag */
#define ETH_DMA_FLAG_TUS                            (ETH_DMA_DMASTSR_TUS)   /*!< Transmit buffer unavailable flag */
#define ETH_DMA_FLAG_TSS                            (ETH_DMA_DMASTSR_TSS)   /*!< Transmit stopped flag */
#define ETH_DMA_FLAG_TIS                            (ETH_DMA_DMASTSR_TIS)   /*!< Transmit interrupt flag */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Error_State ETH DMA Error State
 * @{
 */
#define ETH_DMA_ERRORSTATE_RX_WRITEDATA             (0UL)                                               /*!< RxDMA generates error while writing data */
#define ETH_DMA_ERRORSTATE_TX_READDATA              (ETH_DMA_DMASTSR_EBUS_1 | ETH_DMA_DMASTSR_EBUS_0)   /*!< TxDMA generates error while reading data */
#define ETH_DMA_ERRORSTATE_RX_WRITEDESC             (ETH_DMA_DMASTSR_EBUS_2)                            /*!< RxDMA generates error while writing descriptor */
#define ETH_DMA_ERRORSTATE_TX_WRITEDESC             (ETH_DMA_DMASTSR_EBUS_2 | ETH_DMA_DMASTSR_EBUS_0)   /*!< TxDMA generates error while writing descriptor */
#define ETH_DMA_ERRORSTATE_RX_READDESC              (ETH_DMA_DMASTSR_EBUS_2 | ETH_DMA_DMASTSR_EBUS_1)   /*!< RxDMA generates error while reading descriptor */
#define ETH_DMA_ERRORSTATE_TX_READDESC              (ETH_DMA_DMASTSR_EBUS)                              /*!< TxDMA generates error while reading descriptor */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Transmit_State ETH DMA Transmit State
 * @{
 */
#define ETH_DMA_TRANSMITSTATE_STOPPED               (0UL)                                               /*!< Stopped - Reset or Stop Tx Command issued */
#define ETH_DMA_TRANSMITSTATE_FETCHING              (ETH_DMA_DMASTSR_TSTS_0)                            /*!< Running - Fetching the Tx descriptor */
#define ETH_DMA_TRANSMITSTATE_WAITING               (ETH_DMA_DMASTSR_TSTS_1)                            /*!< Running - Waiting for status */
#define ETH_DMA_TRANSMITSTATE_READING               (ETH_DMA_DMASTSR_TSTS_1 | ETH_DMA_DMASTSR_TSTS_0)   /*!< Running - Reading the data from host memory */
#define ETH_DMA_TRANSMITSTATE_WRITING               (ETH_DMA_DMASTSR_TSTS_2)                            /*!< Running - Writing the time stamp */
#define ETH_DMA_TRANSMITSTATE_SUSPENDED             (ETH_DMA_DMASTSR_TSTS_2 | ETH_DMA_DMASTSR_TSTS_1)   /*!< Suspended - Tx Descriptor unavailable */
#define ETH_DMA_TRANSMITSTATE_CLOSING               (ETH_DMA_DMASTSR_TSTS)                              /*!< Running - Closing Rx descriptor */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Receive_State ETH DMA Receive State
 * @{
 */
#define ETH_DMA_RECEIVESTATE_STOPPED                (0UL)                                               /*!< Stopped - Reset or Stop Rx Command issued */
#define ETH_DMA_RECEIVESTATE_FETCHING               (ETH_DMA_DMASTSR_RSTS_0)                            /*!< Running - Fetching the Rx descriptor */
#define ETH_DMA_RECEIVESTATE_WAITING                (ETH_DMA_DMASTSR_RSTS_1 | ETH_DMA_DMASTSR_RSTS_0)   /*!< Running - Waiting for packet */
#define ETH_DMA_RECEIVESTATE_SUSPENDED              (ETH_DMA_DMASTSR_RSTS_2)                            /*!< Suspended - Rx Descriptor unavailable */
#define ETH_DMA_RECEIVESTATE_CLOSING                (ETH_DMA_DMASTSR_RSTS_2 | ETH_DMA_DMASTSR_RSTS_0)   /*!< Running - Closing descriptor */
#define ETH_DMA_RECEIVESTATE_WRITING                (ETH_DMA_DMASTSR_RSTS_2 | ETH_DMA_DMASTSR_RSTS_1)   /*!< Running - Writing the time stamp */
#define ETH_DMA_RECEIVESTATE_QUEUING                (ETH_DMA_DMASTSR_RSTS)                              /*!< Running - Queuing the receive frame into host memory */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Interrupt ETH DMA Interrupt
 * @{
 */
#define ETH_DMA_INT_NIE                             (ETH_DMA_INTENAR_NIE)   /*!< Normal interrupt summary */
#define ETH_DMA_INT_AIE                             (ETH_DMA_INTENAR_AIE)   /*!< Abnormal interrupt summary */
#define ETH_DMA_INT_ERE                             (ETH_DMA_INTENAR_ERE)   /*!< Early receive interrupt */
#define ETH_DMA_INT_FBE                             (ETH_DMA_INTENAR_FBE)   /*!< Fatal bus error interrupt */
#define ETH_DMA_INT_ETE                             (ETH_DMA_INTENAR_ETE)   /*!< Early transmit interrupt */
#define ETH_DMA_INT_RWE                             (ETH_DMA_INTENAR_RWE)   /*!< Receive watchdog timeout interrupt */
#define ETH_DMA_INT_RSE                             (ETH_DMA_INTENAR_RSE)   /*!< Receive process stopped interrupt */
#define ETH_DMA_INT_RUE                             (ETH_DMA_INTENAR_RUE)   /*!< Receive buffer unavailable interrupt */
#define ETH_DMA_INT_RIE                             (ETH_DMA_INTENAR_RIE)   /*!< Receive interrupt */
#define ETH_DMA_INT_UNE                             (ETH_DMA_INTENAR_UNE)   /*!< Transmit Underflow interrupt */
#define ETH_DMA_INT_OVE                             (ETH_DMA_INTENAR_OVE)   /*!< Receive Overflow interrupt */
#define ETH_DMA_INT_TJE                             (ETH_DMA_INTENAR_TJE)   /*!< Transmit jabber timeout interrupt */
#define ETH_DMA_INT_TUE                             (ETH_DMA_INTENAR_TUE)   /*!< Transmit buffer unavailable interrupt */
#define ETH_DMA_INT_TSE                             (ETH_DMA_INTENAR_TSE)   /*!< Transmit process stopped interrupt */
#define ETH_DMA_INT_TIE                             (ETH_DMA_INTENAR_TIE)   /*!< Transmit interrupt */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Overflow ETH DMA Overflow
 * @{
 */
#define ETH_DMA_OVERFLOW_RXFIFO_COUNTER             (ETH_DMA_RFRCNTR_OVFOVF)  /*!< Overflow bit for FIFO overflow counter */
#define ETH_DMA_OVERFLOW_MISSFRAME_COUNTER          (ETH_DMA_RFRCNTR_UNAOVF)  /*!< Overflow bit for miss frame counter */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Descriptor_Own ETH DMA Descriptor Own
 * @{
 */
#define ETH_DMADESC_OWN_CPU                         (0UL)                 /*!< The descriptor is owned by CPU */
#define ETH_DMADESC_OWN_DMA                         (ETH_DMATXDESC_OWN)   /*!< The descriptor is owned by DMA */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Descriptor_Buffer ETH DMA Descriptor Buffer
 * @{
 */
#define ETH_DMADESC_BUFFER1                         ((uint8_t)0x00UL)   /*!< DMA Desc Buffer1 */
#define ETH_DMADESC_BUFFER2                         ((uint8_t)0x01UL)   /*!< DMA Desc Buffer2 */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Tx_Descriptor_Checksum_Insertion_Control ETH DMA Tx Descriptor Checksum Insertion Control
 * @{
 */
#define ETH_DMATXDESC_CHECKSUM_BYPASS               (ETH_DMATXDESC_CIC_BYPASS)              /*!< Checksum Engine is bypassed */
#define ETH_DMATXDESC_CHECKSUM_IPV4HEADER           (ETH_DMATXDESC_CIC_IPV4HEADER)          /*!< IPv4 header checksum insertion  */
#define ETH_DMATXDESC_CHECKSUM_TCPUDPICMP_SEGMENT   (ETH_DMATXDESC_CIC_TCPUDPICMP_SEGMENT)  /*!< TCP/UDP/ICMP Checksum Insertion calculated over segment only */
#define ETH_DMATXDESC_CHECKSUM_TCPUDPICMP_FULL      (ETH_DMATXDESC_CIC_TCPUDPICMP_FULL)     /*!< TCP/UDP/ICMP Checksum Insertion fully calculated */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Tx_Descriptor_VLAN_Insertion_Control ETH DMA Tx Descriptor VLAN Insertion Control
 * @{
 */
#define ETH_DMATXDESC_VLAN_BYPASS                   (ETH_DMATXDESC_VLANC_BYPASS)        /*!< VLAN Insertion is bypassed */
#define ETH_DMATXDESC_VLAN_REMOVE_TAG               (ETH_DMATXDESC_VLANC_REMOVE_TAG)    /*!< Remove Tag and Type fields in VLAN frame */
#define ETH_DMATXDESC_VLAN_INSERT_TAG               (ETH_DMATXDESC_VLANC_INSERT_TAG)    /*!< Insert VLAN Tag value in ETH_MAC_VTACTLR Register into transmit frame */
#define ETH_DMATXDESC_VLAN_REPLACE_TAG              (ETH_DMATXDESC_VLANC_REPLACE_TAG)   /*!< Replace VLAN tag value in transmit frame with VLAN tag value in ETH_MAC_VTACTLR register */
/**
 * @}
 */

/**
 * @defgroup ETH_DMA_Tx_Descriptor_SA_Insertion_Control ETH DMA Tx Descriptor SA Insertion Control
 * @{
 */
#define ETH_DMATXDESC_SA_BYPASS                     (ETH_DMATXDESC_SAIRC_BYPASS)            /*!< Source Address Insertion or Replace Control is bypassed */
#define ETH_DMATXDESC_SA_INSTER_MACADDR0            (ETH_DMATXDESC_SAIRC_INSTER_MACADDR0)   /*!< Insert address value in MAC address register 0 into transmit frame as SA address */
#define ETH_DMATXDESC_SA_REPLACE_MACADDR0           (ETH_DMATXDESC_SAIRC_REPLACE_MACADDR0)  /*!< Replace SA address in transmit frame with address value in MAC address register 0 */
#define ETH_DMATXDESC_SA_INSTER_MACADDR1            (ETH_DMATXDESC_SAIRC_INSTER_MACADDR1)   /*!< Insert address value in MAC address register 1 into transmit frame as SA address */
#define ETH_DMATXDESC_SA_REPLACE_MACADDR1           (ETH_DMATXDESC_SAIRC_REPLACE_MACADDR1)  /*!< Replace SA address in transmit frame with address value in MAC address register 1 */
/**
 * @}
 */

/**
 * @defgroup ETH_PMT_Flag ETH PMT Flag
 * @{
 */
#define ETH_PMT_FLAG_RTWKFR                         (ETH_MAC_PMTCTLR_RTWKFR)  /*!< Wake-Up Frame Filter Register Pointer Reset */
#define ETH_PMT_FLAG_WKFR                           (ETH_MAC_PMTCTLR_WKFR)    /*!< Wake-Up Frame Received */
#define ETH_PMT_FLAG_MPFR                           (ETH_MAC_PMTCTLR_MPFR)    /*!< Magic Packet Received */
/**
 * @}
 */

/**
 * @defgroup ETH_PMT_Wakeup_Source ETH PMT Wakeup Source
 * @{
 */
#define ETH_PMT_WAKEUP_GLOBAL_UNICAST               (ETH_MAC_PMTCTLR_GLUB)  /*!< Global unicast */
#define ETH_PMT_WAKEUP_WAKEUP_FRAME                 (ETH_MAC_PMTCTLR_WKEN)  /*!< Wake-Up Frame */
#define ETH_PMT_WAKEUP_MAGIC_PACKET                 (ETH_MAC_PMTCTLR_MPEN)  /*!< Magic Packet */
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Counter_Preset_Mode ETH MMC Counter Preset Mode
 * @{
 */
#define ETH_MMC_COUNTER_PRESETMODE_DISABLE          (0UL)                                               /*!< Disable preset */
#define ETH_MMC_COUNTER_PRESETMODE_HALFVALUE        (ETH_MMC_MMCCTLR_MCPSET)                            /*!< Half-Value preset: 0x7FF0 */
#define ETH_MMC_COUNTER_PRESETMODE_FULLVALUE        (ETH_MMC_MMCCTLR_MCPSEL | ETH_MMC_MMCCTLR_MCPSET)   /*!< Full-Value preset: 0xFFF0 */
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Read_Reset ETH MMC Read Reset
 * @{
 */
#define ETH_MMC_READ_RESET_DISABLE                  (0UL)
#define ETH_MMC_READ_RESET_ENABLE                   (ETH_MMC_MMCCTLR_ROR)
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Counter_Reload ETH MMC Counter Reload
 * @{
 */
#define ETH_MMC_COUNTER_RELOAD_DISABLE              (ETH_MMC_MMCCTLR_COS)
#define ETH_MMC_COUNTER_RELOAD_ENABLE               (0UL)
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Tx_Flag ETH MMC Tx Flag
 * @{
 */
#define ETH_MMC_FLAG_TXEDEIS                        (ETH_MMC_TRSSTSR_TXEDEIS)   /*!< When Tx excessive deferral error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXUGIS                         (ETH_MMC_TRSSTSR_TXUGIS)    /*!< When Tx unicast good frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXCAEIS                        (ETH_MMC_TRSSTSR_TXCAEIS)   /*!< When Tx carrier error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXECEIS                        (ETH_MMC_TRSSTSR_TXECEIS)   /*!< When Tx excessive collision error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXLCEIS                        (ETH_MMC_TRSSTSR_TXLCEIS)   /*!< When Tx deferral collision error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXDEEIS                        (ETH_MMC_TRSSTSR_TXDEEIS)   /*!< When Tx deferral error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXMGIS                         (ETH_MMC_TRSSTSR_TXMGIS)    /*!< When Tx multicast good frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_TXBGIS                         (ETH_MMC_TRSSTSR_TXBGIS)    /*!< When Tx broadcast good frame counter reaches half or all the maximum value */
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Rx_Flag ETH MMC Rx Flag
 * @{
 */
#define ETH_MMC_FLAG_RXOEIS                         (ETH_MMC_REVSTSR_RXOEIS)   /*!< When Rx out of scope error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXLEIS                         (ETH_MMC_REVSTSR_RXLEIS)   /*!< When Rx length error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXUGIS                         (ETH_MMC_REVSTSR_RXUGIS)   /*!< When Rx unicast good frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXREIS                         (ETH_MMC_REVSTSR_RXREIS)   /*!< When Rx short error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXAEIS                         (ETH_MMC_REVSTSR_RXAEIS)   /*!< When Rx alignment error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXCEIS                         (ETH_MMC_REVSTSR_RXCEIS)   /*!< When Rx crc error frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXMGIS                         (ETH_MMC_REVSTSR_RXMGIS)   /*!< When Rx multicast good frame counter reaches half or all the maximum value */
#define ETH_MMC_FLAG_RXBGIS                         (ETH_MMC_REVSTSR_RXBGIS)   /*!< When Rx broadcast good frame counter reaches half or all the maximum value */
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Tx_Interrupt ETH MMC Tx Interrupt
 * @{
 */
#define ETH_MMC_INT_TXEDEIM                         (ETH_MMC_TITCTLR_TXEDEIM)   /*!< Tx excessive deferral error frame interrupt */
#define ETH_MMC_INT_TXUGIM                          (ETH_MMC_TITCTLR_TXUGIM)    /*!< Tx unicast good frame interrupt */
#define ETH_MMC_INT_TXCAEIM                         (ETH_MMC_TITCTLR_TXCAEIM)   /*!< Tx carrier error frame interrupt */
#define ETH_MMC_INT_TXECEIM                         (ETH_MMC_TITCTLR_TXECEIM)   /*!< Tx excessive collision error frame interrupt */
#define ETH_MMC_INT_TXLCEIM                         (ETH_MMC_TITCTLR_TXLCEIM)   /*!< Tx deferral collision error frame interrupt */
#define ETH_MMC_INT_TXDEEIM                         (ETH_MMC_TITCTLR_TXDEEIM)   /*!< Tx deferral error frame interrupt */
#define ETH_MMC_INT_TXMGIM                          (ETH_MMC_TITCTLR_TXMGIM)    /*!< Tx multicast good frame interrupt */
#define ETH_MMC_INT_TXBGIM                          (ETH_MMC_TITCTLR_TXBGIM)    /*!< Tx broadcast good frame interrupt */
/**
 * @}
 */

/**
 * @defgroup ETH_MMC_Rx_Interrupt ETH MMC Rx Interrupt
 * @{
 */
#define ETH_MMC_INT_RXOEIM                          (ETH_MMC_RITCTLR_RXOEIM)   /*!< Rx out of scope error frame interrupt */
#define ETH_MMC_INT_RXLEIM                          (ETH_MMC_RITCTLR_RXLEIM)   /*!< Rx length error frame interrupt */
#define ETH_MMC_INT_RXUGIM                          (ETH_MMC_RITCTLR_RXUGIM)   /*!< Rx unicast good frame interrupt */
#define ETH_MMC_INT_RXREIM                          (ETH_MMC_RITCTLR_RXREIM)   /*!< Rx short error frame interrupt */
#define ETH_MMC_INT_RXAEIM                          (ETH_MMC_RITCTLR_RXAEIM)   /*!< Rx alignment error frame interrupt */
#define ETH_MMC_INT_RXCEIM                          (ETH_MMC_RITCTLR_RXCEIM)   /*!< Rx crc error frame interrupt */
#define ETH_MMC_INT_RXMGIM                          (ETH_MMC_RITCTLR_RXMGIM)   /*!< Rx multicast good frame interrupt */
#define ETH_MMC_INT_RXBGIM                          (ETH_MMC_RITCTLR_RXBGIM)   /*!< Rx broadcast good frame interrupt */
/**
 * @}
 */

