RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
/**
 * @defgroup ETH_MMC_Statistical_Register ETH MMC Statistical Register
 * @{
 */
#define ETH_MMC_REG_TXBRGFR                         (0x011CU)   /*!< Tx broadcast good frame Statistical Register */
#define ETH_MMC_REG_TXMUGFR                         (0x0120U)   /*!< Tx multicast good frame Statistical Register */
#define ETH_MMC_REG_TXDEEFR                         (0x0154U)   /*!< Tx deferral error frame Statistical Register */
#define ETH_MMC_REG_TXLCEFR                         (0x0158U)   /*!< Tx deferral collision error frame Statistical Register */
#define ETH_MMC_REG_TXECEFR                         (0x015CU)   /*!< Tx excessive collision error frame Statistical Register */
#define ETH_MMC_REG_TXCAEFR                         (0x0160U)   /*!< Tx carrier error frame Statistical Register */
#define ETH_MMC_REG_TXUNGFR                         (0x0168U)   /*!< Tx unicast good frame Statistical Register */
#define ETH_MMC_REG_TXEDEFR                         (0x016CU)   /*!< Tx excessive deferral error frame Statistical Register */
#define ETH_MMC_REG_RXBRGFR                         (0x018CU)   /*!< Rx broadcast good frame Statistical Register */
#define ETH_MMC_REG_RXMUGFR                         (0x0190U)   /*!< Rx multicast good frame Statistical Register */
#define ETH_MMC_REG_RXCREFR                         (0x0194U)   /*!< Rx crc error frame Statistical Register */
#define ETH_MMC_REG_RXALEFR                         (0x0198U)   /*!< Rx alignment error frame Statistical Register */
#define ETH_MMC_REG_RXRUEFR                         (0x019CU)   /*!< Rx short error frame Statistical Register */
#define ETH_MMC_REG_RXUNGFR                         (0x01C4U)   /*!< Rx unicast good frame Statistical Register */
#define ETH_MMC_REG_RXLEEFR                         (0x01C8U)   /*!< Rx length error frame Statistical Register */
#define ETH_MMC_REG_RXOREFR                         (0x01CCU)   /*!< Rx out of scope error frame Statistical Register */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Frame_DA_Filter ETH PTP Frame DA Filter
 * @{
 */
#define ETH_PTP_FRAME_DA_FILTER_DISABLE             (0x00800000UL)
#define ETH_PTP_FRAME_DA_FILTER_ENABLE              (ETH_PTP_TSPCTLR_TSPADF)
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Snapshot_Datagram_Type ETH PTP Snapshot Datagram Type
 * @{
 */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY             (0UL)                                                                                   /*!< SYNC Follow_Up Delay_Req Delay_Resp */
#define ETH_PTP_DATAGRAM_TYPE_SYNC                          (ETH_PTP_TSPCTLR_TSPMTSEL_0)                                                            /*!< SYNC */
#define ETH_PTP_DATAGRAM_TYPE_DELAY                         (ETH_PTP_TSPCTLR_TSPMTSEL_1 | ETH_PTP_TSPCTLR_TSPMTSEL_0)                               /*!< Delay_Req */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY_PDELAY      (ETH_PTP_TSPCTLR_TSPMTSEL_2)                                                            /*!< SYNC Follow_Up Delay_Req Delay_Resp Pdelay_Req Pdelay_Resp Pdelay_Resp_Follow_Up */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_PDELAY                   (ETH_PTP_TSPCTLR_TSPMTSEL_2 | ETH_PTP_TSPCTLR_TSPMTSEL_0)                               /*!< SYNC Pdelay_Req Pdelay_Resp */
#define ETH_PTP_DATAGRAM_TYPE_DELAY_PDEALY                  (ETH_PTP_TSPCTLR_TSPMTSEL_2 | ETH_PTP_TSPCTLR_TSPMTSEL_1 | ETH_PTP_TSPCTLR_TSPMTSEL_0)  /*!< Delay_Req Pdelay_Req Pdelay_Resp */
#define ETH_PTP_DATAGRAM_TYPE_SYNC_DELAY                    (ETH_PTP_TSPCTLR_TSPMTSEL_3)                                                            /*!< SYNC Delay_Req */
#define ETH_PTP_DATAGRAM_TYPE_PDELAY                        (ETH_PTP_TSPCTLR_TSPMTSEL_3 | ETH_PTP_TSPCTLR_TSPMTSEL_2)                               /*!< Pdelay_Req Pdelay_Resp */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Snapshot_Frame_Type ETH PTP Snapshot Frame Type
 * @{
 */
#define ETH_PTP_FRAME_TYPE_IPV4FRAME                (ETH_PTP_TSPCTLR_TSPOVIPV4)   /*!< Time stamp snapshot for IPv4 frame */
#define ETH_PTP_FRAME_TYPE_IPV6FRAME                (ETH_PTP_TSPCTLR_TSPOVIPV6)   /*!< Time stamp snapshot for IPv6 frame */
#define ETH_PTP_FRAME_TYPE_ETHERNETFRAME            (ETH_PTP_TSPCTLR_TSPOVETH)    /*!< Time stamp snapshot for PTP over ethernet frame */
#define ETH_PTP_FRAME_TYPE_ALL_RECEIVEFRAME         (ETH_PTP_TSPCTLR_TSPEALL)     /*!< Time stamp snapshot for all received frame */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Datagram_Version ETH PTP Datagram Version
 * @{
 */
#define ETH_PTP_DATAGRAM_VERSION_IEEE1588V1         (0UL)
#define ETH_PTP_DATAGRAM_VERSION_IEEE1588V2         (ETH_PTP_TSPCTLR_TSPVER)
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Subsecond_Scale ETH PTP Subsecond Scale
 * @{
 */
#define ETH_PTP_SUBSECOND_SCALE_HEX                 (0UL)                     /*!< The Second register increase 1 when SubSecond count to 0x7FFFFFFFH */
#define ETH_PTP_SUBSECOND_SCALE_DEC                 (ETH_PTP_TSPCTLR_TSPSSR)  /*!< The Second register increase 1 when SubSecond count to 0x3B9AC9FFH */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Calibration_Mode ETH PTP Calibration Mode
 * @{
 */
#define ETH_PTP_CALIBRATION_MODE_COARSE             (0UL)                       /*!< Coarse calibration */
#define ETH_PTP_CALIBRATION_MODE_FINE               (ETH_PTP_TSPCTLR_TSPUPSEL)  /*!< Fine calibration */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Time_Update_Sign ETH PTP Time Update Sign
 * @{
 */
#define ETH_PTP_TIME_UPDATE_SIGN_MINUS              (0UL)                       /*!< Minus for update register value */
#define ETH_PTP_TIME_UPDATE_SIGN_PLUS               (ETH_PTP_TMUNSER_TSPUPNS)   /*!< Plus for update register value */
/**
 * @}
 */

/**
 * @defgroup ETH_PTP_Flag ETH PTP Flag
 * @{
 */
#define ETH_PTP_FLAG_TSERR1                         (ETH_PTP_TSPSTSR_TSERR1)  /*!< Target time 1 error */
#define ETH_PTP_FLAG_TSTAR1                         (ETH_PTP_TSPSTSR_TSTAR1)  /*!< Target time 1 reached  */
#define ETH_PTP_FLAG_TSERR0                         (ETH_PTP_TSPSTSR_TSERR0)  /*!< Target time 0 error */
#define ETH_PTP_FLAG_TSTAR0                         (ETH_PTP_TSPSTSR_TSTAR0)  /*!< Target time 0 reached */
#define ETH_PTP_FLAG_TSOVF                          (ETH_PTP_TSPSTSR_TSOVF)   /*!< System time overflow */
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Target_Channel ETH PPS Target Channel
 * @{
 */
#define ETH_PPS_TARGET_CH0                          (0x00U)
#define ETH_PPS_TARGET_CH1                          (0x01U)
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Target_Time_Function ETH PPS Target Time Function
 * @{
 */
#define ETH_PPS_TARGET_TIME_FUNC_INT_EVENT          (0UL)                       /*!< The Target register is used only for interrupt output event */
#define ETH_PPS_TARGET_TIME_FUNC_INT_PPS_EVENT      (ETH_PTP_PPSCTLR_TT0SEL_1)  /*!< The Target register is used for interrupt out event and PPS single output event */
#define ETH_PPS_TARGET_TIME_FUNC_PPS_EVENT          (ETH_PTP_PPSCTLR_TT0SEL)    /*!< The Target register is used for PPS single output event */
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Output_Mode ETH PPS Output Mode
 * @note PPS1(ETH_PPS_TARGET_CH1) only supports single output mode(ETH_PPS_OUTPUT_MODE_SINGLE).
 * @{
 */
#define ETH_PPS_OUTPUT_MODE_CONTINUE                (0UL)                     /*!< Continuous output mode */
#define ETH_PPS_OUTPUT_MODE_SINGLE                  (ETH_PTP_PPSCTLR_PPSOMD)  /*!< Single output mode */
/**
 * @}
 */

/**
 * @defgroup ETH_PPS_Output_Frequency ETH PPS Output Frequency
 * @note PPS1(ETH_PPS_TARGET_CH1) only supports generate a pulse(ETH_PPS_OUTPUT_ONE_PULSE).
 * @{
 */
#define ETH_PPS_OUTPUT_FREQ_1HZ                     (0UL)                                                                                 /*!< Ouput pulse is 1HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_2HZ                     (ETH_PTP_PPSCTLR_PPSFRE0_0)                                                           /*!< Ouput pulse is 2HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_4HZ                     (ETH_PTP_PPSCTLR_PPSFRE0_1)                                                           /*!< Ouput pulse is 4HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_8HZ                     (ETH_PTP_PPSCTLR_PPSFRE0_1 | ETH_PTP_PPSCTLR_PPSFRE0_0)                               /*!< Ouput pulse is 8HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_16HZ                    (ETH_PTP_PPSCTLR_PPSFRE0_2)                                                           /*!< Ouput pulse is 16HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_32HZ                    (ETH_PTP_PPSCTLR_PPSFRE0_2 | ETH_PTP_PPSCTLR_PPSFRE0_0)                               /*!< Ouput pulse is 32HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_64HZ                    (ETH_PTP_PPSCTLR_PPSFRE0_2 | ETH_PTP_PPSCTLR_PPSFRE0_1)                               /*!< Ouput pulse is 64HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_128HZ                   (ETH_PTP_PPSCTLR_PPSFRE0_2 | ETH_PTP_PPSCTLR_PPSFRE0_1 | ETH_PTP_PPSCTLR_PPSFRE0_0)   /*!< Ouput pulse is 128HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_256HZ                   (ETH_PTP_PPSCTLR_PPSFRE0_3)                                                           /*!< Ouput pulse is 256HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_512HZ                   (ETH_PTP_PPSCTLR_PPSFRE0_3 | ETH_PTP_PPSCTLR_PPSFRE0_0)                               /*!< Ouput pulse is 512HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_1024HZ                  (ETH_PTP_PPSCTLR_PPSFRE0_3 | ETH_PTP_PPSCTLR_PPSFRE0_1)                               /*!< Ouput pulse is 1024HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_2048HZ                  (ETH_PTP_PPSCTLR_PPSFRE0_3 | ETH_PTP_PPSCTLR_PPSFRE0_1 | ETH_PTP_PPSCTLR_PPSFRE0_0)   /*!< Ouput pulse is 2048HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_4096HZ                  (ETH_PTP_PPSCTLR_PPSFRE0_3 | ETH_PTP_PPSCTLR_PPSFRE0_2)                               /*!< Ouput pulse is 4096HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_8192HZ                  (ETH_PTP_PPSCTLR_PPSFRE0_3 | ETH_PTP_PPSCTLR_PPSFRE0_2 | ETH_PTP_PPSCTLR_PPSFRE0_0)   /*!< Ouput pulse is 8192HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_16384HZ                 (ETH_PTP_PPSCTLR_PPSFRE0_3 | ETH_PTP_PPSCTLR_PPSFRE0_2 | ETH_PTP_PPSCTLR_PPSFRE0_1)   /*!< Ouput pulse is 16384HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_FREQ_32768HZ                 (ETH_PTP_PPSCTLR_PPSFRE0)                                                             /*!< Ouput pulse is 32768HZ in continuous ouput mode */
#define ETH_PPS_OUTPUT_ONE_PULSE                    (ETH_PTP_PPSCTLR_PPSFRE0_0)                                                           /*!< One pulse is generated in single ouput mode */
/**
 * @}
 */

/**
 * @}
 */

