RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_eth.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup ETH_Global_Functions
 * @{
 */

/**
 * @brief  Generate MAC pause control frame.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void ETH_MAC_GeneratePauseCtrlFrame(void)
{
    WRITE_REG32(bM4_ETH->MAC_FLOCTLR_b.FCA_BPA, Enable);
}

/**
 * @brief  Get MAC flow control status.
 * @param  None
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
__STATIC_INLINE en_flag_status_t ETH_MAC_GetFlowCtrlStatus(void)
{
    return ((en_flag_status_t)READ_REG32(bM4_ETH->MAC_FLOCTLR_b.FCA_BPA));
}

/**
 * @brief  Resume the DMA Transmit.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void ETH_DMA_ResumeTransmit(void)
{
    WRITE_REG32(M4_ETH->DMA_TXPOLLR, 0U);
}

/**
 * @brief  Resume the DMA Receive.
 * @param  None
 * @retval None
 */
__STATIC_INLINE void ETH_DMA_ResumeReceive(void)
{
    WRITE_REG32(M4_ETH->DMA_RXPOLLR, 0U);
}

/**
 * @brief  Get DMA error status.
 * @param  None
 * @retval uint32_t                         The new DMA error status
 *         The error status may be one of the following values:
 *           - ETH_DMA_ERRORSTATE_RX_WRITEDATA:   TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERRORSTATE_TX_READDATA:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERRORSTATE_RX_WRITEDESC:   TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERRORSTATE_TX_WRITEDESC:   TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERRORSTATE_RX_READDESC:    TxDMA generates error while reading descriptor
 *           - ETH_DMA_ERRORSTATE_TX_READDESC:    TxDMA generates error while reading descriptor
 */
__STATIC_INLINE uint32_t ETH_DMA_GetErrorStatus(void)
{
    return (READ_REG32_BIT(M4_ETH->DMA_DMASTSR, ETH_DMA_DMASTSR_EBUS));
}

/**
 * @brief  Get DMA transmit status.
 * @param  None
 * @retval uint32_t                         The new DMA transmit status
 *           The transmit status may be one of the following values:
 *           - ETH_DMA_TRANSMITSTATE_STOPPED:     Stopped - Reset or Stop Tx Command issued
 *           - ETH_DMA_TRANSMITSTATE_FETCHING:    Running - Fetching the Tx descriptor
 *           - ETH_DMA_TRANSMITSTATE_WAITING:     Running - Waiting for status
 *           - ETH_DMA_TRANSMITSTATE_READING:     Running - Reading the data from host memory
 *           - ETH_DMA_TRANSMITSTATE_WRITING:     Running - Writing the time stamp
 *           - ETH_DMA_TRANSMITSTATE_SUSPENDED:   Suspended - Tx Descriptor unavailable
 *           - ETH_DMA_TRANSMITSTATE_CLOSING:     Running - Closing Rx descriptor
 */
__STATIC_INLINE uint32_t ETH_DMA_GetTransmitStatus(void)
{
    return (READ_REG32_BIT(M4_ETH->DMA_DMASTSR, ETH_DMA_DMASTSR_TSTS));
}

/**
 * @brief  Get DMA receive status.
 * @param  None
 * @retval uint32_t                         The new DMA receive status
 *           The receive status may be one of the following values:
 *           - ETH_DMA_RECEIVESTATE_STOPPED:      Stopped - Reset or Stop Rx Command issued
 *           - ETH_DMA_RECEIVESTATE_FETCHING:     Running - Fetching the Rx descriptor
 *           - ETH_DMA_RECEIVESTATE_WAITING:      Running - Waiting for packet
 *           - ETH_DMA_RECEIVESTATE_SUSPENDED:    Suspended - Rx Descriptor unavailable
 *           - ETH_DMA_RECEIVESTATE_CLOSING:      Running - Closing descriptor
 *           - ETH_DMA_RECEIVESTATE_WRITING:      Running - Writing the time stamp
 *           - ETH_DMA_RECEIVESTATE_QUEUING:      Running - Queuing the receive frame into host memory
 */
__STATIC_INLINE uint32_t ETH_DMA_GetReceiveStatus(void)
{
    return (READ_REG32_BIT(M4_ETH->DMA_DMASTSR, ETH_DMA_DMASTSR_RSTS));
}

/**
 * @brief  Get DMA Rx Overflow Missed Frame Counter value.
 * @param  None
 * @retval uint32_t                         Rx Overflow Missed Frame Counter value
 */
__STATIC_INLINE uint32_t ETH_DMA_GetRxOvfMissFrameCnt(void)
{
    return ((READ_REG32_BIT(M4_ETH->DMA_RFRCNTR, ETH_DMA_RFRCNTR_OVFCNT)) >> ETH_DMA_RFRCNTR_OVFCNT_POS);
}

/**
 * @brief  Get DMA Buffer Unavailable Missed Frame Counter value.
 * @param  None
 * @retval uint32_t                         Buffer Unavailable Missed Frame Counter value
 */
__STATIC_INLINE uint32_t ETH_DMA_GetBufferUnavaiMissFrameCnt(void)
{
    return (READ_REG32_BIT(M4_ETH->DMA_RFRCNTR, ETH_DMA_RFRCNTR_UNACNT));
}

/**
 * @brief  Get DMA current Tx descriptor start address.
 * @param  None
 * @retval uint32_t                         Transmit descriptor start address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurTxDescAddr(void)
{
    return (READ_REG32(M4_ETH->DMA_CHTXDER));
}

/**
 * @brief  Get DMA current Rx descriptor start address.
 * @param  None
 * @retval uint32_t                         Receive descriptor start address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurRxDescAddr(void)
{
    return (READ_REG32(M4_ETH->DMA_CHRXDER));
}

/**
 * @brief  Get DMA current Tx buffer address.
 * @param  None
 * @retval uint32_t                         Transmit buffer address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurTxBufferAddr(void)
{
    return (READ_REG32(M4_ETH->DMA_CHTXBFR));
}

/**
 * @brief  Get DMA current Rx buffer address.
 * @param  None
 * @retval uint32_t                         Receive buffer address
 */
__STATIC_INLINE uint32_t ETH_DMA_GetCurRxBufferAddr(void)
{
    return (READ_REG32(M4_ETH->DMA_CHRXBFR));
}

/**
 * @brief  Get PMT wakeup frame filter register pointer index.
 * @param  None
 * @retval uint8_t                          Filter register pointer index.
 */
__STATIC_INLINE uint8_t ETH_PMT_GetWakeupFramePointerIndex(void)
{
    return ((uint8_t)(READ_REG32_BIT(M4_ETH->MAC_PMTCTLR, ETH_MAC_PMTCTLR_RTWKPT) >> ETH_MAC_PMTCTLR_RTWKPT_POS));
}

/**
 * @brief  Get PTP snapshot frame type.
 * @param  None
 * @retval uint32_t                         Receive frame type
 */
__STATIC_INLINE uint32_t ETH_PTP_GetSnapFrameType(void)
{
    return (READ_REG32_BIT(M4_ETH->PTP_TSPCTLR,
                           (ETH_PTP_TSPCTLR_TSPOVIPV4 | ETH_PTP_TSPCTLR_TSPOVIPV6 |
                            ETH_PTP_TSPCTLR_TSPOVETH  | ETH_PTP_TSPCTLR_TSPEALL)));
}

en_result_t ETH_DeInit(void);
en_result_t ETH_Init(stc_eth_handle_t *pstcEthHandle, stc_eth_init_t *pstcEthInit);
en_result_t ETH_CommStructInit(stc_eth_comm_init_t *pstcCommInit);
en_result_t ETH_StructInit(stc_eth_init_t *pstcEthInit);
en_result_t ETH_Start(void);
en_result_t ETH_Stop(void);

/* PHY Functions */
en_result_t ETH_PHY_WriteRegister(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t u16RegVal);
en_result_t ETH_PHY_ReadRegister(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t *pu16RegVal);
en_result_t ETH_PHY_LoopBackCmd(stc_eth_handle_t *pstcEthHandle, en_functional_state_t enNewSta);

/* MAC Functions */
void ETH_MAC_DeInit(void);
en_result_t ETH_MAC_Init(stc_eth_handle_t *pstcEthHandle, const stc_eth_mac_init_t *pstcMacInit);
en_result_t ETH_MAC_StructInit(stc_eth_mac_init_t *pstcMacInit);
void ETH_MAC_SetDuplexSpeed(uint32_t u32DuplexMode, uint32_t u32Speed);
void ETH_MAC_SetHashTable(uint32_t u32HashHigh, uint32_t u32HashLow);
void ETH_MAC_SetTxVlanTagVal(uint16_t u16TxTag);
void ETH_MAC_SetRxVlanTagVal(uint16_t u16RxTag);
void ETH_MAC_SetRxVlanHashTable(uint16_t u16HashVal);
void ETH_MAC_LoopBackCmd(en_functional_state_t enNewSta);
void ETH_MAC_GeneratePauseCtrlFrame(void);
void ETH_MAC_BackPressureCmd(en_functional_state_t enNewSta);
void ETH_MAC_TransmitCmd(en_functional_state_t enNewSta);
void ETH_MAC_ReceiveCmd(en_functional_state_t enNewSta);
void ETH_MAC_IntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta);
en_flag_status_t ETH_MAC_GetIntStatus(uint32_t u32Flag);
en_flag_status_t ETH_MAC_GetFlowCtrlStatus(void);

/* MAC Address Functions */
void ETH_MACADDR_DeInit(uint32_t u32Index);
en_result_t ETH_MACADDR_Init(uint32_t u32Index, const stc_eth_mac_addr_config_t *pstcMacAddrInit);
en_result_t ETH_MACADDR_StructInit(stc_eth_mac_addr_config_t *pstcMacAddrInit);
en_result_t ETH_MACADDR_SetAddress(uint32_t u32Index, uint8_t au8Addr[]);
en_result_t ETH_MACADDR_GetAddress(uint32_t u32Index, uint8_t au8Addr[]);
void ETH_MACADDR_SetFilterMode(uint32_t u32Index, uint32_t u32Mode);
void ETH_MACADDR_SetFilterMask(uint32_t u32Index, uint32_t u32Mask);

/* MAC L3L4 Filter Functions */
void ETH_MAC_L3L4FilterDeInit(void);
en_result_t ETH_MAC_L3L4FilterInit(const stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit);
en_result_t ETH_MAC_L3L4FilterStructInit(stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit);
void ETH_MAC_L3L4FilterCmd(en_functional_state_t enNewSta);
void ETH_MAC_SetPortFilterProtocol(uint32_t u32PortProtocol);
void ETH_MAC_SetDestPortFilterVal(uint16_t u16Port);
void ETH_MAC_SetSrcPortFilterVal(uint16_t u16Port);
void ETH_MAC_SetAddrFilterProtocol(uint32_t u32AddrProtocol);
void ETH_MAC_SetIpv4DestAddrFilterVal(uint32_t u32Addr);
void ETH_MAC_SetIpv4SrcAddrFilterVal(uint32_t u32Addr);
en_result_t ETH_MAC_SetIpv6AddrFilterVal(const uint32_t au32Addr[]);

/* DMA Functions */
void ETH_DMA_DeInit(void);
en_result_t ETH_DMA_Init(const stc_eth_dma_init_t *pstcDmaInit);
en_result_t ETH_DMA_StructInit(stc_eth_dma_init_t *pstcDmaInit);
en_result_t ETH_DMA_SoftwareReset(void);
void ETH_DMA_ResumeTransmit(void);
void ETH_DMA_ResumeReceive(void);
void ETH_DMA_SetTransPrioRatio(uint32_t u32PrioRatio);
void ETH_DMA_SetRxWatchdogCounter(uint8_t u8Value);
en_result_t ETH_DMA_FlushTransmitFIFO(void);
void ETH_DMA_TransmitCmd(en_functional_state_t enNewSta);
void ETH_DMA_ReceiveCmd(en_functional_state_t enNewSta);
void ETH_DMA_IntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta);
en_flag_status_t ETH_DMA_GetStatus(uint32_t u32Flag);
uint32_t ETH_DMA_GetErrorStatus(void);
uint32_t ETH_DMA_GetTransmitStatus(void);
uint32_t ETH_DMA_GetReceiveStatus(void);
en_flag_status_t ETH_DMA_GetOvfStatus(uint32_t u32Flag);
uint32_t ETH_DMA_GetRxOvfMissFrameCnt(void);
uint32_t ETH_DMA_GetBufferUnavaiMissFrameCnt(void);
uint32_t ETH_DMA_GetCurTxDescAddr(void);
uint32_t ETH_DMA_GetCurRxDescAddr(void);
uint32_t ETH_DMA_GetCurTxBufferAddr(void);
uint32_t ETH_DMA_GetCurRxBufferAddr(void);

/* DMA descriptor Functions */
en_result_t ETH_DMA_TxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcTxDescTab[], const uint8_t au8TxBuffer[], uint32_t u32TxBufferCnt);
en_result_t ETH_DMA_RxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcRxDescTab[], const uint8_t au8RxBuffer[], uint32_t u32RxBufferCnt);
en_result_t ETH_DMA_SetTransmitFrame(stc_eth_handle_t *pstcEthHandle, uint32_t u32FrameLength);
en_result_t ETH_DMA_GetReceiveFrame(stc_eth_handle_t *pstcEthHandle);
en_result_t ETH_DMA_GetReceiveFrame_Interrupt(stc_eth_handle_t *pstcEthHandle);
en_result_t ETH_DMA_SetTxDescOwn(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Owner);
en_result_t ETH_DMA_SetTxDescBufferSize(stc_eth_dma_desc_t *pstcTxDesc, uint8_t u8BufferNum, uint32_t u32BufferSize);
en_result_t ETH_DMA_TxDescChecksumInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32ChecksumMode);
en_result_t ETH_DMA_TxDescVlanInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32VlanMode);
en_result_t ETH_DMA_TxDescSAInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32SAMode);
en_result_t ETH_DMA_TxDescCRCCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta);
en_result_t ETH_DMA_TxDescPADCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta);
en_result_t ETH_DMA_TxDescTimestamp(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta);
en_result_t ETH_DMA_TxDescReplaceCRCCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta);
en_result_t ETH_DMA_TxDescIntCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewSta);
en_flag_status_t ETH_DMA_GetTxDescStatus(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Flag);
en_result_t ETH_DMA_GetTxDescCollisionCnt(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32ColliCnt);
en_result_t ETH_DMA_GetTxDescTimeStamp(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32High, uint32_t *pu32Low);
en_result_t ETH_DMA_SetRxDescOwn(stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Owner);
en_result_t ETH_DMA_RxDescIntCmd(stc_eth_dma_desc_t *pstcRxDesc, en_functional_state_t enNewSta);
en_flag_status_t ETH_DMA_GetRxDescStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag);
en_flag_status_t ETH_DMA_GetRxDescExtendStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag);
en_result_t ETH_DMA_GetRxDescPayloadType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32PayloadType);
en_result_t ETH_DMA_GetRxDescDatagramType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32DatagramType);
en_result_t ETH_DMA_GetRxDescFrameLength(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32FrameLength);
en_result_t ETH_DMA_GetRxDescBufferSize(const stc_eth_dma_desc_t *pstcRxDesc, uint8_t u8BufferNum, uint32_t *pu32BufferSize);
en_result_t ETH_DMA_GetRxDescTimeStamp(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32High, uint32_t *pu32Low);

/* MAC PMT Functions */
en_result_t ETH_PMT_ResetWakeupFramePointer(void);
en_result_t ETH_PMT_WriteWakeupFrameRegister(const uint32_t au32RegBuffer[]);
void ETH_PMT_ForwardWakeupFrameCmd(en_functional_state_t enNewSta);
void ETH_PMT_WakeupSourceCmd(uint32_t u32WakeupSrc, en_functional_state_t enNewSta);
en_result_t ETH_PMT_EnterPowerDown(void);
en_flag_status_t ETH_PMT_GetStatus(uint32_t u32Flag);
uint8_t ETH_PMT_GetWakeupFramePointerIndex(void);

/* MMC Functions */
en_result_t ETH_MMC_DeInit(void);
en_result_t ETH_MMC_Init(const stc_eth_mmc_init_t *pstcMmcInit);
en_result_t ETH_MMC_StructInit(stc_eth_mmc_init_t *pstcMmcInit);
en_result_t ETH_MMC_CounterReset(void);
void ETH_MMC_ResetAfterReadCmd(en_functional_state_t enNewSta);
void ETH_MMC_Cmd(en_functional_state_t enNewSta);
void ETH_MMC_TxIntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta);
void ETH_MMC_RxIntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta);
en_flag_status_t ETH_MMC_GetTxStatus(uint32_t u32Flag);
en_flag_status_t ETH_MMC_GetRxStatus(uint32_t u32Flag);
uint32_t ETH_MMC_GetRegister(uint32_t u32Reg);

/* PTP Functions */
void ETH_PTP_DeInit(void);
en_result_t ETH_PTP_Init(const stc_eth_ptp_init_t *pstcPtpInit);
en_result_t ETH_PTP_StructInit(stc_eth_ptp_init_t *pstcPtpInit);
void ETH_PTP_SetSnapDatagramType(uint32_t u32DatagramType);
void ETH_PTP_SetSnapFrameType(uint32_t u32FrameType);
uint32_t ETH_PTP_GetSnapFrameType(void);
void ETH_PTP_SetCalibMode(uint32_t u32CalibMode);
en_result_t ETH_PTP_UpdateBasicIncValue(void);
en_result_t ETH_PTP_UpdateSystemTime(void);
en_result_t ETH_PTP_SystemTimeInit(void);
en_result_t ETH_PTP_GetSystemTime(uint32_t *pu32Sec, uint32_t *pu32SubSec);
void ETH_PTP_SetIncValue(uint32_t u32BasicVal, uint8_t u8SubSecVal);
en_result_t ETH_PTP_GetIncValue(uint32_t *pu32BasicVal, uint8_t *pu8SubSecVal);
void ETH_PTP_SetUpdateTime(uint32_t u32Sign, uint32_t u32Sec, uint32_t u32SubSec);
void ETH_PTP_Cmd(en_functional_state_t enNewSta);
void ETH_PTP_IntCmd(en_functional_state_t enNewSta);
en_flag_status_t ETH_PTP_GetStatus(uint32_t u32Flag);

/* PTP PPS Functions */
void ETH_PPS_DeInit(uint8_t u8Ch);
en_result_t ETH_PPS_Init(uint8_t u8Ch, const stc_eth_pps_config_t *pstcPpsInit);
en_result_t ETH_PPS_StructInit(stc_eth_pps_config_t *pstcPpsInit);
void ETH_PPS_SetTargetTime(uint8_t u8Ch, uint32_t u32Sec, uint32_t u32SubSec);
void ETH_PPS_SetTargetTimeFunc(uint8_t u8Ch, uint32_t u32Func);
void ETH_PPS_SetPps0OutputMode(uint32_t u32OutputMode);
void ETH_PPS_SetPps0OutputFreq(uint32_t u32OutputFreq);

/**
 * @}
 */

#endif /* DDL_ETH_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0_ETH_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
